{
    "jitterbug": {
        "description": "The Jitterbug sounds like a twist on a classic. Here's a tip: **Balance is key!**  Start with a solid base of gin and vodka, then layer in the sweetness of grenadine and sugar/syrup.  Lime juice provides the tartness, but don't overdo it. Top with soda water for a refreshing fizz.  Taste as you go, adjusting sweetness and sourness to your preference. "
    },
    "rum_old_fashioned": {
        "description": "For a balanced Rum Old Fashioned, use a good quality light rum as your base and a splash of 151 for warmth. Don't overdo the powdered sugar, just enough to dissolve in the water and create a light syrup. A few dashes of Angostura bitters are key for complexity. Muddle lime peel gently to release oils, not bitterness, and use a large ice cube to chill slowly. "
    },
    "flannel_shirt": {
        "description": "This drink is all about balance.  Use a good quality blended scotch, and don't be afraid to let the Amaro shine through.  A touch of Demerara gum syrup sweetens it up nicely, but don't go overboard.  The apple cider adds a welcome complexity, so use a good quality one.  Shake hard with ice to chill it down and get the flavors melding.  Garnish with an apple slice or cinnamon stick for a final touch. "
    },
    "dry_martini": {
        "description": "**Chill everything!**  Gin, vermouth, and the glass should all be ice cold.  **Use a quality gin** and a **dry vermouth**.  **Stir, don't shake!**  Shaking will dilute the cocktail.  **Garnish with an olive or a lemon twist.**  Remember, **a good Martini is all about balance**.  Don't overpower the gin with too much vermouth.  **Taste as you go** and adjust the vermouth to your liking. "
    },
    "martini": {
        "description": "For a perfect Martini, use high-quality gin and dry vermouth. Chill both ingredients thoroughly, but don't freeze them. The ratio of gin to vermouth is personal preference, but classic is 2:1. Stir with ice, don't shake, to prevent dilution. Strain into a chilled martini glass and garnish with an olive or lemon twist. Remember, a good Martini is all about balance and subtlety. "
    },
    "pink_panty_pulldowns": {
        "description": "For a perfectly balanced Pink Panty Pulldown, start with a good quality vodka. Use a highball glass filled with ice and pour in the Sprite first, followed by the Pink Lemonade. This helps maintain a bubbly texture. Finish with the vodka, gently pouring it over the back of a spoon to create a layered effect. Garnish with a lemon wedge or a pink grapefruit slice for a pop of color. "
    },
    "queen_charlotte": {
        "description": "For a balanced Queen Charlotte, start with a good quality dry red wine. Don't skimp on the grenadine – it adds the sweetness and vibrant color. Use a chilled glass and add the soda last for a bubbly fizz.  A splash of lemon juice can brighten the flavor. Adjust the proportions to your liking, but keep the red wine dominant for a true Queen's touch. "
    },
    "fall_in_manhattan": {
        "description": "This is a delicious twist on the classic!  First, use a high-quality rye, like Rittenhouse, for the best flavor.  Don't over-shake this one, you want a crisp, clear drink.  A dash of bitters goes a long way, so add just a few drops to enhance the complexity.  Finally, the Demerara Gum Syrup adds a unique sweetness, so adjust to your taste. "
    },
    "flaming_dr_pepper": {
        "description": ""
    },
    "greyhound": {
        "description": "For a perfect Greyhound, use fresh grapefruit juice, not bottled.  Chill both the vodka and juice before mixing for a refreshing drink.  Rim the glass with sugar for a sweet twist, or salt for a savory kick.  Don't over-shake, as it can bruise the grapefruit juice and create bitterness.  Serve it tall and icy, garnished with a grapefruit wedge. "
    },
    "yellow_bird": {
        "description": "For a vibrant Yellow Bird, use fresh lime juice for optimal tang. Shake vigorously with ice to chill thoroughly. Strain into a chilled coupe or martini glass for a refreshing presentation. A light, frothy head adds to the visual appeal. Garnish with a lime wheel or a twist for a final touch. "
    },
    "151_florida_bushwacker": {
        "description": "This is a recipe that benefits from proper layering. Start with the heavier ingredients at the bottom: dark creme de cacao, milk, vanilla ice cream. Then add the lighter ones, like the rums, coconut liqueur, and Cointreau.  Don't over-blend, you want some texture. Chill the glass beforehand and use a good quality rum for a truly decadent Bushwacker. "
    },
    "zippys_revenge": {
        "description": "Zippy's Revenge is a fun, but tricky one.  Start with a good quality Amaretto for sweetness.  Use dark rum for depth, but be careful not to overpower the other flavors.  Kool-Aid is the wildcard - use a strong flavor like Cherry or Tropical Punch.  Shaking is key to blending the flavors, but don't overdo it or you'll dilute the taste.  A splash of club soda helps with fizz and adds a refreshing touch. "
    },
    "mocha_berry": {
        "description": "Chill your glass beforehand for a frosty presentation.  Use a good quality coffee, freshly brewed, for the best flavor. When adding Chambord, use a bar spoon to gently swirl it into the coffee for a beautiful marbled effect.  Dust with cocoa powder right before serving, ensuring a fresh, unclumped coating. A light touch with the whipped cream is key – you want it to compliment, not overwhelm the other flavors. "
    },
    "shooting_blancs": {
        "description": "For a balanced Shooting Blancs, focus on the passionfruit syrup.  Don't go overboard, aim for a subtle sweetness.  Shake hard with ice to chill and dilute properly.  Ancho Reyes brings heat, so adjust based on your preference.  A good grapefruit bitters will round out the citrus notes.  Strain into a chilled coupe and garnish with a grapefruit twist for an extra aromatic kick. "
    },
    "freddy_kruger": {
        "description": "This drink is all about layering, so chill your ingredients beforehand for the best visual effect.  Pour the Jägermeister slowly down the side of the glass, followed by the Sambuca (it'll float), and top with vodka for a clean finish.  Don't stir – you want distinct layers!  Use a shot glass for a traditional presentation or a rocks glass for a larger serving. "
    },
    "lassi_khara": {
        "description": "For a balanced Lassi Khara, use full-fat yogurt for richness.  Start with a 2:1 ratio of yogurt to water, adjusting to your preference.  A pinch of salt enhances the tang, while a touch of asafetida adds depth.  Remember, less is more with the asafetida - you want to hint at its aroma, not overpower the yogurt.  Chill the drink for a refreshing finish. "
    },
    "lassi_mango": {
        "description": "For the best mango lassi, use ripe, juicy mangoes. Blend them with chilled yogurt for a smooth, creamy texture. Don't over-sweeten – start with a small amount of sugar and adjust to taste.  Use good quality yogurt for the best flavor. A splash of water can help thin the consistency if needed. Garnish with a mango slice and a pinch of cardamom for an extra touch. "
    },
    "zambeer": {
        "description": "The key to a great Zambeer is balance. Use high-quality Sambuca for its anise flavor. Start with a 1:2 ratio of Sambuca to Root Beer, but adjust to taste. Don't over-ice; you want the Sambuca to shine through. For a visual touch, layer the Sambuca on the bottom, then gently add the Root Beer over it. "
    },
    "boomerang": {
        "description": "For a perfect Boomerang, chill your glass and ingredients beforehand. Use a high-quality gin and a good dry vermouth for the best flavor.  Don't be shy with the bitters; they add complexity.  Gently muddle the cherry to release its essence, but don't crush it.  A light hand with the Maraschino liqueur ensures the gin shines through.  Remember, a well-chilled, well-balanced Boomerang is a cocktail you'll want to come back to. "
    },
    "quentin": {
        "description": "The Quentin is a delicious, creamy, and decadent cocktail. Here are some tips for success:* **Chill your ingredients:**  This will ensure a cold and refreshing drink.* **Use quality rum:**  The flavor of the rum will be prominent, so choose a dark rum with rich notes.* **Don't overdo the nutmeg:**  A light dusting is all you need. Too much will overpower the other flavors.* **Shake well with ice:**  This will properly chill and combine the ingredients.* **Garnish with a sprinkle of nutmeg and a cherry:**  This adds a beautiful touch. "
    },
    "dublin_heights": {
        "description": "Ensure the orgeat syrup is fresh and high quality - it's the backbone of the cocktail.  Use a good Irish whiskey, and don't skimp on the St. George Pear Liqueur - it adds complexity.  Shake vigorously with ice to chill and dilute properly.  Top with club soda for a light, refreshing finish.  Garnish with a lemon twist and a pear slice for a touch of elegance. "
    },
    "floradora": {
        "description": "For a perfect Floradora, ensure your raspberry gum syrup is fresh and vibrant. Use a good quality gin, not too heavy. Shake well with ice to chill and dilute slightly. When building, layer the ginger syrup first for a distinct flavor, followed by gin and lime juice. Top with soda water, keeping it bubbly. Garnish with a lime wedge and a sprig of mint for a touch of elegance. "
    },
    "bijou": {
        "description": "The Bijou's elegance lies in its balance.  Use a good quality gin and a reputable Green Chartreuse.  Start with a small amount of bitters, adding more to taste.  Stir the drink with ice to chill thoroughly, then strain into a chilled coupe.  A lemon twist garnish adds a refreshing touch.  Don't over-muddle the bitters, as it can make the drink bitter. "
    },
    "tequila_slammer": {
        "description": "The Tequila Slammer is a simple but powerful drink.  Chill your 7-Up beforehand for a refreshing experience.  Use a good quality tequila, as the flavor will shine through.  A shot glass is perfect for this cocktail, allowing you to enjoy the full slam!  And don't forget, moderation is key! "
    },
    "abc": {
        "description": "The ABC is a creamy, sweet, and sophisticated drink.  When mixing, remember that Baileys is quite thick.  Use a cocktail shaker with ice and shake vigorously to blend all ingredients evenly.  Strain into a chilled coupe glass.  Garnish with a coffee bean or a drizzle of chocolate for an extra touch of decadence. "
    },
    "rum_toddy": {
        "description": "Use high-quality dark rum for a richer flavor. Don't skimp on the lemon peel - a generous twist releases the most citrus oils. Use hot water, but not boiling, to dissolve the sugar and prevent the rum from burning. Stir, don't shake, to avoid diluting the rum.  A good rum toddy should be warm and comforting, not overly sweet. "
    },
    "fig_jam": {
        "description": "To elevate your Fig Jam, use a high-quality fig syrup with a deep, complex flavor.  Ensure your rye is robust to stand up to the sweetness.  For a smoother finish, opt for a less-bitter orange liqueur.  Don't be shy with the balsamic vinegar; a few drops add a touch of savory depth.  Finally, a good stir ensures proper dilution and a balanced cocktail. "
    },
    "gin_fizz": {
        "description": "Use a good quality gin for the best flavor.  Freshly squeezed lemon juice is key, and a dash of egg white gives a creamy texture.  Shake vigorously with ice to chill and build a head of foam.  Don't over-shake, as this will create a cloudy drink.  For a sweeter fizz, add a touch more powdered sugar."
    },
    "happy_skipper": {
        "description": "For a Happy Skipper, start with a chilled glass.  Muddle lime wedges to release their oils and create a fragrant base.  Use a good quality spiced rum for depth of flavor.  Top with chilled ginger ale and stir gently, not shake, to maintain the fizz.  Garnish with a lime wheel and enjoy the refreshing, tropical vibe! "
    },
    "monkey_wrench": {
        "description": "For a balanced Monkey Wrench, fresh grapefruit juice is key. Use a good quality light rum, not overly sweet. A few dashes of Angostura bitters add complexity, but go easy – you don't want them to overpower the citrus. Shake well with ice to chill and dilute, then strain into a chilled coupe glass. A grapefruit wedge garnish adds a nice touch! "
    },
    "drinking_chocolate": {
        "description": "To elevate your Drinking Chocolate, use high-quality chocolate and vanilla.  Warm the milk and cream gently to dissolve the chocolate fully, avoiding boiling.  Infuse the cinnamon directly in the warm milk for a deeper flavor.  Don't over-whip the cream, a soft peak is ideal.  Garnish with a sprinkle of cinnamon or chocolate shavings for visual appeal. "
    },
    "kiss_me_quick": {
        "description": ""
    },
    "russian_spring_punch": {
        "description": "For the best Russian Spring Punch, use high-quality vodka and crème de cassis.  A good ratio is 2 parts vodka to 1 part crème de cassis.  Make sure your sugar syrup is simple and not overly sweet. Freshly squeezed lemon juice is key for balance. Shake ingredients with ice and strain into a chilled coupe glass. Garnish with a lemon twist for that perfect touch. "
    },
    "victor": {
        "description": "The Victor is a classic, but its success hinges on balance.  Use a good quality gin, and choose a sweet vermouth with a hint of bitterness. The brandy adds complexity, so opt for a smooth, aged variety. Chill your ingredients beforehand, and use a good ice to ensure proper dilution. Don't over-shake, as you want the flavors to meld, not become frothy. Finally, garnish with an orange twist for a fragrant touch. "
    },
    "irish_cream": {
        "description": "This cocktail is a sweet, creamy delight.  For best results, use quality Scotch and high-quality half-and-half. Chill all ingredients beforehand for a smoother consistency.  Shake vigorously with ice to thoroughly combine all flavors.  Strain into a chilled cocktail glass and garnish with a chocolate curl or a sprinkle of cocoa powder. "
    },
    "tequila_surprise": {
        "description": "This cocktail is all about balance.  A little Tabasco goes a long way! Start with a single drop and taste. Add more if you like, but keep it subtle.  Use a good quality tequila for a better flavor profile.  A good garnish, like a lime wedge or a jalapeño slice, can enhance the taste and add a visual appeal.  Remember, this is a spicy cocktail, so enjoy it slowly. "
    },
    "rum_punch": {
        "description": "For a perfect Rum Punch, remember to use a high-quality rum, as it's the star of the show.  Start with a good base of fruit punch, then add a splash of orange juice for brightness.  Keep the ginger ale light, just enough to add a hint of fizz.  Don't over-ice it - just enough to chill the drink.  And most importantly, taste as you go to adjust sweetness and balance.  Garnish with a cherry or orange slice for a festive touch. "
    },
    "dragonfly": {
        "description": "Use a high-quality gin for a more complex flavor profile. Muddle a lime wedge in the bottom of the glass for added zest. Fill with ice and top with ginger ale, gently stirring to avoid over-carbonation. Garnish with a lime wheel or a sprig of fresh mint. "
    },
    "orange_scented_hot_chocolate": {
        "description": "Use high-quality chocolate for a richer flavor.  Grate the orange peel, don't just zest it, for maximum orange essence.  Steep the orange peel and nutmeg in the hot milk for a few minutes to infuse the flavor.  Use freshly brewed espresso for a strong coffee flavor.  Don't over-sweeten! The natural sweetness of the chocolate and milk should be enough.  Garnish with a fresh orange peel. "
    },
    "flying_dutchman": {
        "description": "When crafting a Flying Dutchman, remember that the gin is the star. Use a high-quality London Dry Gin for a crisp, juniper-forward flavor.  Chill the gin and Triple Sec beforehand for a perfectly chilled cocktail.  Shake hard with ice to thoroughly chill and dilute the drink. Strain into a chilled coupe glass and garnish with a lemon twist for a refreshing touch. "
    },
    "deadpan_fix": {
        "description": "For a perfect Deadpan Fix, make sure your ginger syrup is fresh and flavorful. Use a good quality rye, and don't skimp on the Campari – it's the backbone of the drink. Shake vigorously with ice to chill and dilute properly.  Finish with a grapefruit twist for a beautiful garnish.  "
    },
    "algonquin": {
        "description": "The Algonquin is a classic but often overlooked cocktail. To elevate it, use a good quality blended whiskey. The key is balance – don't overdo the pineapple juice, it should be a subtle sweetness.  Chill your ingredients beforehand for a refreshing experience.  A twist of orange peel adds a lovely aromatic touch. "
    },
    "cuba_libre": {
        "description": "For a perfect Cuba Libre, use high-quality light rum for a clean flavor.  Muddle lime wedges directly in the glass to release their oils and fragrance. Don't overfill with ice - you want enough to chill the drink without diluting it too quickly.  Top with Coke, but be mindful of the ratio: you want enough Coke to complement the rum and lime, but not overwhelm it.  A twist of lime completes the classic, refreshing cocktail. "
    },
    "chocolate_drink": {
        "description": "For a smooth chocolate drink, use high-quality chocolate. Melt it gently over a double boiler or in the microwave, stirring constantly.  Chill the milk before adding it to the melted chocolate for a richer texture.  Don't over-heat the mixture, as it can become grainy.  Use a milk frother to create a luxurious, creamy texture, or top with whipped cream for an indulgent finish.  Enjoy! "
    },
    "gin_cooler": {
        "description": "For the Gin Cooler, chill your gin and glass beforehand.  Use a bar spoon to gently stir in the powdered sugar, ensuring it fully dissolves.  A light touch with the carbonated water is key; aim for a gentle pour to maintain fizziness.  Use a citrus peeler to create a long, thin orange spiral for garnish, ensuring it's fresh and bright.  Finally, add a lemon peel twist to the drink for a refreshing aroma. "
    },
    "sweet_tooth": {
        "description": "For the Sweet Tooth, remember that Godiva liqueur is already rich and decadent, so don't overpower it with too much milk. Use a good quality whole milk for creaminess.  Chill both the liqueur and milk before mixing. Shake vigorously with ice to ensure proper dilution and a smooth, frothy texture.  Serve in a chilled coupe or martini glass, garnished with a chocolate shavings or a chocolate-dipped strawberry. "
    },
    "shark_attack": {
        "description": ""
    },
    "raspberry_cooler": {
        "description": "For a perfectly balanced Raspberry Cooler, use good quality raspberry vodka.  Chill it and your soda beforehand for a refreshing experience.  Don't over-ice the drink, just enough to chill the vodka.  A light hand with the soda is key; you want the raspberry flavor to shine, not get lost in fizz.  A lemon wedge garnish adds a beautiful touch and enhances the citrus notes. "
    },
    "screwdriver": {
        "description": "A Screwdriver is all about fresh, bright flavors. Use high-quality vodka and freshly squeezed orange juice. Chill both ingredients beforehand for a crisp, refreshing drink.  Don't over-shake, as this will dilute the flavors. Garnish with an orange slice or a twist. Remember, less is more! "
    },
    "halloween_punch": {
        "description": "To make your Halloween Punch a hit, use fresh ginger and orange peel for the best flavor.  Muddle the ginger and cloves gently to release their essence, but avoid pulverizing them.  A few chili flakes add a subtle kick, but be careful not to overdo it.  Chill your vodka beforehand, as it'll keep the punch icy cold and refreshing.  Strain the punch after infusing to avoid any stray chili flakes or ginger bits in your drink.  Enjoy! "
    },
    "siesta": {
        "description": "This cocktail, Siesta, is a refreshing, bittersweet concoction. To ensure optimal taste, use a high-quality tequila, preferably reposado. The Campari and grapefruit juice provide a balanced bitterness, so adjust their proportions to taste. Freshly squeezed lime juice is essential, and a touch of gum syrup helps round out the flavor. Shake well with ice, strain into a chilled coupe glass, and garnish with a grapefruit twist for an extra touch of citrus. "
    },
    "grand_blue": {
        "description": "For a vibrant Grand Blue, start with chilled ingredients. Layer the Malibu and Peach Schnapps first, then carefully pour the Blue Curaçao on top, creating a distinct blue layer. Gently add sweet and sour last, ensuring a smooth transition between the layers.  Shake well to blend the flavors before serving in a chilled glass. "
    },
    "porto_flip": {
        "description": "Use high-quality brandy and port for the best flavor.  Ensure the egg yolk is at room temperature for easier emulsification.  Shake vigorously with ice to chill and create a frothy texture.  Strain into a chilled coupe glass for a smooth presentation.  Don't over-shake, or the drink will become too watery.  Garnish with a twist of orange peel for an elegant touch. "
    },
    "kir_royale": {
        "description": "Chill your Champagne thoroughly before mixing.  Use high-quality Crème de Cassis, as it makes all the difference.  A good ratio is 1 part Crème de Cassis to 5 parts Champagne, but adjust to your taste. Pour the Crème de Cassis into the Champagne flute first, then top with Champagne gently, ensuring a beautiful layering effect. Garnish with a fresh raspberry or blackcurrant for a classic touch. "
    },
    "iron_ranger": {
        "description": "Use a high-quality Demerara syrup for a rich caramel note.  Shake the ingredients hard with ice to fully chill and meld the flavors. Strain into a chilled coupe, ensuring a clean pour.  A small dash of bitters on top adds a complex aromatic touch.  Garnish with a pineapple wedge or a lemon twist. "
    },
    "flyover": {
        "description": "To make a flawless Flyover, focus on the balance.  Shake the grapefruit cordial, ginger syrup, and lime juice vigorously to ensure the flavors meld perfectly.  Add the bourbon and orange liqueur last for a smooth, layered effect.  Don't over-ice it; let the flavors shine! "
    },
    "oreo_mudslide": {
        "description": "For the perfect Oreo Mudslide, use high-quality vodka and Kahlua.  Soften the vanilla ice cream slightly for easier blending.  Don't overblend! You want a thick, milkshake-like consistency. Crush the Oreo cookies finely and use a cocktail shaker to chill the drink before serving. Garnish with a crumbled Oreo for that final touch. "
    },
    "white_wine_sangria": {
        "description": "For a vibrant White Wine Sangria, use ripe, juicy fruit and muddle gently to release their aromas without making the drink bitter.  Add the apple brandy for a warm, complex flavor.  Chill the sangria thoroughly before serving.  When assembling, layer the ingredients to create a visually appealing presentation.  Top with soda water just before serving to retain fizziness. "
    },
    "jack_rose": {
        "description": "**Jack's Rose Tips:**- Use fresh lime juice for optimal flavor.- Shake with ice until the shaker is frosty cold.- Strain into a chilled coupe glass.- Garnish with a lime wheel or a sprig of fresh rosemary.- Taste and adjust sweetness to preference with more grenadine. "
    },
    "paradise": {
        "description": "For a balanced Paradise, use a high-quality gin with botanicals that complement apricot.  A good apricot brandy adds sweetness and complexity, so don't skimp on quality there either.  Freshly squeezed orange juice is key - it's the base of the drink, so avoid store-bought.  Shake well with ice to chill and meld flavors, and strain into a chilled coupe glass.  A simple orange twist garnish adds a nice touch. "
    },
    "royal_flush": {
        "description": "Chill all ingredients beforehand for a perfectly crisp cocktail.  When shaking, use a light hand to avoid over-diluting the flavors.  For a vibrant red hue, use high-quality cranberry juice.  Garnish with a fresh raspberry and a sprig of mint for a touch of elegance. "
    },
    "gluehwein": {
        "description": "For the best Gluehwein, use a good quality dry red wine. Simmer gently, never boil, to extract flavors without evaporating alcohol.  Don't oversweeten, adjust sugar to your taste.  Use fresh spices, not pre-ground, for optimal flavor.  Strain before serving to remove spices, ensuring a smooth drink.  Serve warm, but not scalding hot. "
    },
    "darkwood_sling": {
        "description": "For a crisp Darkwood Sling, use high-quality soda water and freshly squeezed orange juice.  Chill your glass beforehand.  When mixing, use a bar spoon to gently stir, ensuring the Cherry Heering blends well with the other ingredients.  Avoid over-shaking as this can dilute the flavors.  A splash of grenadine can add a beautiful red hue and deepen the cherry notes. "
    },
    "french_martini": {
        "description": "Chill your shaker and ingredients beforehand. This ensures a perfectly chilled and refreshing drink. Use a good quality raspberry liqueur for a richer flavor. Shake vigorously to thoroughly chill and mix the ingredients. Strain into a chilled martini glass for a beautiful presentation. Garnish with a fresh raspberry for a touch of elegance. "
    },
    "gin_smash": {
        "description": "Use a muddler to gently crush the mint and orange, not pulverize them.  A few pieces of orange zest will add complexity.  Sugar syrup helps dissolve quickly, but a simple syrup with a touch of orange blossom water elevates the flavor.  For a refreshing fizz, use a good quality tonic water and gently top with ice to avoid dilution.  Garnish with a fresh mint sprig and a maraschino cherry. "
    },
    "kool_aid_slammer": {
        "description": "The Kool-Aid Slammer is a classic for a reason!  Here's how to make it great: * Use good quality vodka, it makes a difference. * Chill the Kool-Aid and vodka beforehand for a refreshing drink. * Make it strong enough, but not too strong - a good 2:1 ratio of Kool-Aid to vodka is ideal. * Don't forget the ice! Keep it cold and don't overfill the glass.* You can rim the glass with sugar for a fun touch. "
    },
    "kool_first_aid": {
        "description": "**Kool First Aid Tips:*** **Use high-quality rum:** 151 proof is strong, so a good rum will shine through.* **Experiment with Kool-Aid flavors:**  Cherry, blue raspberry, and grape work well.* **Start with a small amount of Kool-Aid:** You can always add more.* **Shake well with ice:** This chills the drink and dilutes it slightly.* **Garnish with a lime wedge or cherry:** For a touch of color and flavor."
    },
    "cafe_savoy": {
        "description": "For a smooth Cafe Savoy, use freshly brewed, strong coffee. Don't over-chill the milk – you want it cold, but not icy. When shaking, use a vigorous motion to ensure proper emulsification. Adjust the sweetness to your liking by adding simple syrup, but remember, the coffee should be the star. Garnish with a coffee bean or a sprinkle of cinnamon for a touch of elegance. "
    },
    "royal_bitch": {
        "description": ""
    },
    "spanish_rumor": {
        "description": "The Spanish Rumor is a delicate balance of flavors.  Use high-quality rye and sweet vermouth, but don't overdo it on the kola syrup—a splash is all you need.  The cherry liqueur adds a touch of sweetness and complexity, but be careful not to overpower the other elements.  Chill your ingredients beforehand and use a good ice cube to keep the drink cold. "
    },
    "kentucky_b_and_b": {
        "description": "The key to a perfect Kentucky B&B is balance. Use high-quality bourbon and Benedictine for the best flavor. Start with a 2:1 ratio of bourbon to Benedictine, then adjust to your taste. Chill the ingredients beforehand for a smoother drink. Stir well with ice to chill and dilute, but don't over-dilute. Garnish with a lemon twist or a brandied cherry. Enjoy responsibly! "
    },
    "fruit_shake": {
        "description": "Start with frozen fruit for a thicker shake.  Use a good quality yogurt, preferably Greek, for tang. Blend everything on high speed until smooth, adding more ice if needed.  Don't over-blend, or it'll become watery. Taste and adjust sweetness with a touch of honey or sugar.  Serve immediately in a chilled glass with a garnish of your choice. "
    },
    "kool_aid_shot": {
        "description": "This shot is a classic Kool-Aid style drink, so aim for bold, vibrant flavors. Use high-quality vodka for a clean base. Measure the Amaretto and Sloe Gin carefully to avoid overwhelming the sweetness.  Triple Sec adds a citrusy kick, but don't overdo it.  Cranberry juice is key to the Kool-Aid experience, so don't skimp on the quantity.  Shake vigorously with ice, then strain into a chilled shot glass. Enjoy responsibly! "
    },
    "kioki_coffee": {
        "description": "For a Kioki Coffee, start by chilling your glass. Use a good quality Kahlua and brandy. To avoid a muddy texture, build the drink over ice, pouring the brandy first, followed by the Kahlua, and then top with strong, freshly brewed coffee. Stir gently and garnish with a coffee bean or cinnamon stick. "
    },
    "jewel_of_the_nile": {
        "description": "Use high-quality gin for a truly vibrant flavor. When layering the Chartreuses, pour the Yellow Chartreuse first to create a beautiful visual effect.  Use a chilled coupe or martini glass to enhance the presentation. Finally, a light garnish with a lemon twist or a sprig of rosemary complements the flavors without overwhelming them. "
    },
    "orange_crush": {
        "description": "For a perfect Orange Crush, use a good quality vodka and fresh-squeezed orange juice.  Shake vigorously with ice to ensure a well-chilled, frothy drink.  Don't skimp on the Triple Sec, it adds the necessary sweetness and orange flavor.  Garnish with a fresh orange slice or wheel for a touch of elegance.  Remember, a balanced Orange Crush is a beautiful thing! "
    },
    "dark_caipirinha": {
        "description": "Use a muddler with a heavy base to crush the lime and sugar, ensuring even extraction of oils. Don't over-muddle, you want a coarse texture, not a paste.  Chill the cachaca beforehand for a crisp, refreshing drink.  Adjust the sugar to your preference - Demerara's molasses notes work well with the cachaca, so err on the sweeter side.  Garnish with a lime wheel for an aromatic touch. "
    },
    "baby_eskimo": {
        "description": "This drink is all about balance and texture. Use good quality Kahlua for a richer flavor.  Chill the milk beforehand for a smoother blend.  Use a blender and pulse the ice cream until smooth, then add the milk and Kahlua, blending just until incorporated. Don't over-blend!  A quick pulse is key for a creamy, frothy consistency. Garnish with a sprinkle of cocoa powder or chocolate shavings. "
    },
    "daiquiri": {
        "description": "For a perfect Daiquiri, fresh lime juice is key. Don't use bottled, the flavor won't be the same.  A good quality light rum is essential, and don't be shy with the sugar!  You want it sweet, but balanced with the lime.  Shake hard with ice to chill it down, and strain into a chilled coupe glass.  A touch of simple syrup can help if the sugar isn't dissolving properly. "
    },
    "alexander": {
        "description": "The Alexander is all about balance. Use a good quality creme de cacao, and don't skimp on the cream! Shake vigorously with ice to chill and emulsify.  A fine layer of nutmeg on top adds aroma and elegance. Don't over-shake, you want it smooth, not frothy.  Serve chilled in a coupe or martini glass. "
    },
    "scotch_sour": {
        "description": "Use a good quality Scotch, preferably a blended whisky.  For the lime and lemon juice, freshly squeezed is best.  Shake hard with ice to chill the drink thoroughly.  The powdered sugar should be dissolved in the juice before adding the Scotch, to ensure a smooth, balanced cocktail.  Don't forget a maraschino cherry for garnish! "
    },
    "kentucky_colonel": {
        "description": "Use a good quality bourbon for best results.  The Benedictine adds sweetness and herbal notes, so adjust the amount to your preference.  A good twist of lemon peel adds a refreshing touch and elevates the drink.  Don't over-muddle the peel - just a light squeeze to release oils.  Serve chilled in a coupe glass for a classic presentation. "
    },
    "kurant_tea": {
        "description": "Use high-quality tea for best flavor.  Steep it strong, then let it cool completely before mixing.  Add sugar to taste, but a bit more sweetness than usual is good here.  Shake well with ice to chill and dilute the cocktail.  The key is balance - the tartness of the Kurant, the floral tea, and the sweetness should all come through.  Garnish with a lemon twist for a fresh touch. "
    },
    "vermouth_cassis": {
        "description": "Chill your glass and ingredients beforehand for a refreshingly cold drink.  Use a good quality dry vermouth, and a generous pour of crème de cassis for a balanced sweetness. Top with chilled carbonated water, gently swirling to create a beautiful layered effect.  Serve immediately."
    },
    "divorce_papers": {
        "description": "For a perfect Divorce Papers, start by shaking your passionfruit syrup and gin with ice. This ensures the syrup blends properly. Then, add the remaining ingredients and shake again. Strain into a chilled coupe glass. For a balanced sweetness, use a good quality honey. Garnish with a lemon twist for an aromatic touch. "
    },
    "camerons_kick": {
        "description": "To make Cameron's Kick sing, balance sweetness and acidity.  Start with a good quality Irish whiskey and blended Scotch.  Use fresh lemon juice and a high-quality orgeat syrup - it's key to the unique flavor profile.  Shake well with ice and double strain into a chilled coupe glass.  Garnish with a lemon twist for a touch of citrus aroma. "
    },
    "dark_and_stormy": {
        "description": "Use a high-quality dark rum for the best flavor.  Fresh ginger beer is ideal, but if using bottled, chill it thoroughly for a crisp taste. Build the drink over ice in a highball glass, pouring rum first, then ginger beer.  Gently stir to combine, leaving a bit of fizz on top. Garnish with a lime wedge or a sprig of fresh mint for an extra touch. "
    },
    "ipamena": {
        "description": "Muddle lime wedges and brown sugar to release the oils and create a fragrant base.  Use fresh passion fruit juice for the best flavor. Add ice before the ginger ale to ensure a well-chilled drink.  Gently stir, don't shake, to avoid excessive dilution. Garnish with a lime wheel and a passion fruit wedge for a vibrant presentation.  Enjoy! "
    },
    "addison": {
        "description": "The Addison is a classic Gin Martini, so focus on the gin!  Choose a quality gin with distinct botanicals for a complex flavor profile.  Chill your glass and gin for a crisp experience.  Use a good vermouth for depth, but don't overdo it.  Stir gently to avoid diluting, and garnish with a lemon twist for a touch of citrus. "
    },
    "winter_rita": {
        "description": "For the Winter Rita,  use a good quality tequila and fresh juices for best flavor. When making the rosemary syrup, use a few sprigs of rosemary for a subtle, not overpowering flavor.  Shake vigorously with ice to ensure proper dilution and chill.  Rim the glass with salt for a touch of savory sweetness.  Garnish with a rosemary sprig for a festive touch. "
    },
    "caipirinha": {
        "description": "For a perfect Caipirinha, muddle the sugar and lime wedges *thoroughly*, until the lime is fully broken down and the sugar is dissolved. This releases the lime's essential oils and creates a delicious base. Use a good quality cachaça, ideally aged for a smoother taste. Finally, add ice and top with cachaça, stirring gently to chill. Don't over-stir, as this will dilute the cocktail. "
    },
    "damned_if_you_do": {
        "description": "This is a fiery combo!  Use high-quality whiskey for a smoother burn.  Chill the Hot Damn beforehand for a refreshing contrast.  Shake hard with ice to dilute slightly and create a frothy top.  Rim the glass with chili powder or cinnamon sugar for a spicy kick.  Garnish with a lime wedge for a bright touch.  "
    },
    "queen_elizabeth": {
        "description": "For a balanced Queen Elizabeth, chill your ingredients thoroughly. Use a quality dry vermouth and a good London Dry gin. Benedictine adds a unique herbal sweetness, so use a light hand to avoid overpowering the gin. Stir with ice until well-chilled, strain into a chilled coupe glass, and garnish with a lemon twist for a touch of citrus. "
    },
    "waikiki_beachcomber": {
        "description": "For a perfectly balanced Waikiki Beachcomber, chill your glass and ingredients beforehand.  Use a good quality gin and fresh pineapple juice.  Shake vigorously with ice to ensure a well-chilled and frothy drink.  Strain into the chilled glass and garnish with a pineapple wedge or a maraschino cherry.  Enjoy! "
    },
    "spritz": {
        "description": "For a perfect Spritz, chill everything! Use a large wine glass filled with ice, and build the drink directly in it for optimal dilution.  Use a good quality Prosecco for best results, and don't skimp on the soda – it balances the bitterness of the Aperol. Remember, it's a light, refreshing drink, so don't over-pour the Aperol! "
    },
    "limona_corona": {
        "description": "Chill your Corona and Bacardi Limon thoroughly.  Use a tall glass filled with ice. Pour Bacardi Limon first, followed by Corona.  Gently stir to mix, keeping the head of the Corona intact. Garnish with a lime wedge and a pinch of salt on the rim for a salty-sweet kick.  Enjoy responsibly! "
    },
    "sol_y_sombra": {
        "description": "For the Sol Y Sombra, use a good quality brandy - it's the star of the show. Ensure your anisette is chilled, it'll add a crispness to the cocktail. Don't overshake, a gentle stir keeps the brandy's complexity intact.  A lemon twist, not a squeeze, gives a subtle citrus note without overwhelming the brandy and anisette."
    },
    "gg": {
        "description": "The GG is a simple, refreshing drink that's easy to make.  Use good quality Galliano for best flavor.  Fill your glass with ice first, then add Galliano and top with ginger ale.  Stir gently to combine and avoid over-diluting.  Garnish with a lemon twist for a touch of citrusy brightness. "
    },
    "millionaire_cocktail": {
        "description": "**For a velvety texture:**  Use a dry shake to emulsify the egg white before adding ice for a silky, frothy top.  **Don't skimp on the Absinthe:** A tiny splash is key for its aroma, but don't overdo it.  **Flavor balance:** Adjust the orange liqueur and lemon juice for your desired sweetness and tartness.  **Presentation:**  Use a coupe or martini glass for its elegant shape and showcase the frothy top. "
    },
    "just_a_moonmint": {
        "description": "This drink is all about balance. Start with a good quality milk, preferably chilled. Measure the chocolate and mint syrups carefully, as they will dominate the flavor profile. Shake vigorously with ice to ensure proper chilling and a creamy texture. If you're feeling adventurous, you can add a touch of vanilla extract to enhance the flavor.  "
    },
    "caipirissima": {
        "description": "For a perfect Caipirissima, muddle the lime and sugar thoroughly to release all the oils and flavors.  Use good quality white rum and don't over-ice. The drink should be refreshing and tart, not watery.  A good muddler is essential, and use a highball glass for plenty of room for ice.  Finally, enjoy your delicious Caipirissima!"
    },
    "hd": {
        "description": "To make a smooth H.D., use good quality whiskey and chilled Baileys.  Start with a rocks glass filled with ice.  Pour the whiskey first, then the Baileys, followed by the coffee. Gently stir to combine, avoiding excessive dilution. Garnish with a coffee bean or a sprinkle of cocoa powder. "
    },
    "pink_penocha": {
        "description": "This is a potent mix, so use Everclear sparingly!  Start with a small amount and adjust to taste.  You can also use a high-quality vodka for a smoother flavor.  Ensure the cranberry juice is chilled for a crisp, refreshing taste. Shake well to combine and chill, and don't forget a fun garnish like an orange slice or maraschino cherry. "
    },
    "passion_fruit_martini": {
        "description": "For a perfect Passion Fruit Martini, use **fresh passion fruit juice** for the best flavor.  **Shake hard** with ice to ensure a smooth, chilled texture. **Strain** the cocktail into a chilled martini glass for a polished presentation.  A **sugar rim** adds a touch of sweetness and visual appeal.  Experiment with **different vodkas** to find your favorite flavor profile. "
    },
    "grass_skirt": {
        "description": "For a vibrant Grass Skirt, chill your ingredients, especially the pineapple juice.  Use fresh pineapple chunks, not canned, for optimal flavor.  Shake vigorously with ice to ensure a frosty, well-chilled cocktail.  Layer the grenadine carefully for a striking visual.  A splash of lime juice adds brightness and balance, while a pineapple wedge garnish adds tropical charm. "
    },
    "kiwi_martini": {
        "description": "For a perfect Kiwi Martini, use ripe but firm kiwis for maximum flavor. Muddle gently, not aggressively, to release juices without creating bitterness. Adjust sugar syrup to taste - some kiwis are sweeter than others.  Strain twice, once through a fine mesh strainer to remove pulp, then again through a cocktail strainer for a pristine finish."
    },
    "vodka_fizz": {
        "description": "Start with a chilled glass to keep the drink cold.  Use good quality vodka, and freshly squeezed lime juice for the best flavor.  Shake vigorously to ensure proper mixing and a smooth texture.  Gently grate nutmeg over the top, avoiding too much for a balanced flavor.  Serve immediately, as the drink will become watered down over time.  Enjoy! "
    },
    "gin_sling": {
        "description": "For a perfect Gin Sling, use a good quality gin and freshly squeezed lemon juice.  Dissolve the powdered sugar in the water to make a simple syrup, ensuring it's fully dissolved before adding to the gin and juice.  Gently muddle the orange peel to release its oils before adding it to the cocktail.  Serve over ice in a tall glass, garnished with a twist of orange peel. "
    },
    "talos_coffee": {
        "description": "Use a strong, freshly brewed coffee for the best flavor.  Chill the Grand Marnier beforehand to ensure a balanced, refreshing cocktail.  Use a good quality ice and a cocktail shaker for optimal dilution and chilling.  Strain into a chilled coupe glass for a sophisticated presentation.  A splash of orange bitters can add complexity. "
    },
    "lexington": {
        "description": "To make a perfect Lexington, ensure your Kola Syrup is fresh and flavorful. Use a good quality Bourbon and a dry vermouth for balance. A dash of Angostura bitters adds complexity.  Chill your glass beforehand and use large ice cubes to maintain a cool temperature. Stir gently to blend the flavors and avoid dilution. Garnish with a lemon twist for a refreshing touch. "
    },
    "frosé": {
        "description": "Use high-quality rosé for a vibrant flavor. Don't be afraid to adjust the sugar to your taste.  For a smooth texture, blend the strawberries well, and strain the mixture for a seed-free drink. A squeeze of fresh lemon juice brightens the flavor and adds a touch of tartness. Chill the mixture thoroughly before serving for a refreshing experience.  "
    },
    "lord_and_lady": {
        "description": "The Lord and Lady is a classic, easy-to-make cocktail.  To ensure a smooth and balanced flavor, use high-quality dark rum and Tia Maria.  Start with a well-chilled glass for a refreshing drink.  Don't over-shake; you want a velvety texture, not a frothy one.  Finally, garnish with a coffee bean or chocolate curl for an elegant touch. "
    },
    "irish_russian": {
        "description": "Start by layering the Kahlua and vodka to avoid mixing. Gently pour the Coca-Cola over the back of a spoon to create a distinct layer. Finish with a slow, careful pour of Guinness Stout. Don't stir! The layers are the beauty of this drink. Enjoy the unique flavor profiles as they dance on your palate. "
    },
    "scofflaw": {
        "description": "Use a good quality rye for a robust base.  Chill the vermouth and lemon juice before mixing for a crisp flavor.  Don't be afraid to adjust the grenadine to your sweetness preference - a touch is all you need.  Shake vigorously with ice for a frothy, well-chilled drink.  Strain into a chilled coupe glass and garnish with a lemon twist. "
    },
    "devil_inside": {
        "description": "When crafting the Devil Inside, focus on layering the flavors. Start with a well-chilled coupe glass.  Use a bar spoon to carefully layer the Demerara syrup, followed by rye, Scotch, and a final splash of Absinthe. Finish with a dash of Peychaud's Bitters for a complex, aromatic finish.  Remember, a light hand with the Absinthe is key. "
    },
    "ginger_cocktail": {
        "description": "Freshly muddle the lime to release its oils for a vibrant aroma. Use a high-quality gin for a clean, balanced flavor. Ensure the ginger syrup is properly balanced - not too sweet or too spicy. Shake vigorously with ice to chill and dilute the cocktail. Strain into a chilled coupe or martini glass, and garnish with a lime wheel for a refreshing finish. "
    },
    "french_tart": {
        "description": "To make a perfect French Tart, ensure your grapefruit juice is freshly squeezed for the best flavor. Use a good quality elderflower liqueur for a floral aroma.  Don't over-shake the cocktail, as it can become cloudy.  Finally, adjust the simple syrup to your desired sweetness level. "
    },
    "jello_shots": {
        "description": "Use high-quality vodka for a cleaner taste.  Don't overcook the Jello, it should be just slightly thickened.  Let the Jello mixture cool completely before pouring into molds.  Use a piping bag for even distribution and a professional look.  For a fun twist, add fruit purée or edible glitter! "
    },
    "pink_gin": {
        "description": "For a perfect Pink Gin, use a high-quality gin and a good Angostura bitters.  A few dashes is all you need - don't overdo it.  A good chill is key, so make sure both the gin and the glass are ice cold.  Gently stir to blend, but avoid shaking, as this can dilute the flavors.  Serve it up in a chilled coupe glass with a twist of lemon or orange peel. "
    },
    "victory_collins": {
        "description": "To make the Victory Collins a winner, use fresh lemon juice for maximum zing. Don't overdo the powdered sugar—start small and adjust to taste.  For a more vibrant hue, use a high-quality, dark-colored grape juice.  Shake well with ice to chill thoroughly, and don't forget a splash of soda water for a light and refreshing finish. Finally, garnish with a lemon twist or an orange slice for a touch of elegance. "
    },
    "gin_toddy": {
        "description": "**Gin Toddy Tips:*** Use a good quality gin, as it's the star of the show.* Dissolve the sugar completely in hot water before adding the gin to avoid a grainy texture.* Add the lemon peel last for a burst of citrus aroma.* Garnish with a lemon twist for visual appeal.* Serve hot in a mug or heatproof glass.* Adjust sweetness to your preference. "
    },
    "pink_lady": {
        "description": "A Pink Lady is all about balance.  Use a good quality gin and apple brandy.  Shake hard with ice to chill thoroughly.  The grenadine adds sweetness, so adjust the amount to your liking.  A fresh squeeze of lemon juice is key, so don't skip it.  Strain into a chilled coupe glass and garnish with a cherry. "
    },
    "rum_milk_punch": {
        "description": "Use whole milk for richness and a creamier texture.  Shake vigorously with ice to chill and emulsify the ingredients.  Don't over-sweeten, taste as you go, and adjust powdered sugar accordingly.  Grate fresh nutmeg for the best aroma, but a pinch of pre-ground will do in a pinch!  Serve immediately for optimal enjoyment. "
    },
    "egg_nog_healthy": {
        "description": "For a smooth, creamy Egg Nog, separate the egg yolks and whites. Whisk the yolks with sugar until pale and fluffy, then slowly add the condensed milk, milk, and vanilla.  Fold in the stiffly beaten egg whites.  Finally, stir in the rum and nutmeg.  Chill for at least 2 hours for the flavors to meld and for a more refreshing drink."
    },
    "sherry_flip": {
        "description": "Use a high-quality sherry for the best flavor.  Ensure the cream is cold for a creamy texture.  Don't over-shake the cocktail, just enough to emulsify.  If you use a whole egg, separate the yolk and white for a smoother texture.  Gently grate nutmeg for a fresh aroma.  Serve immediately, the flavor fades quickly. "
    },
    "flaming_lamborghini": {
        "description": "This is a layered shot, so use a shot glass and layer carefully. Start with the heaviest ingredient, Baileys, then Kahlua, followed by Sambuca. The Blue Curacao is drizzled on top for a visual effect.  Be mindful of the Sambuca's flammability.  Light it carefully with a long match and let the flames subside before consuming."
    },
    "zimadori_zinger": {
        "description": "This is a fun, playful twist on a classic!  To make the Zimadori Zinger, remember to chill both the Midori and Zima beforehand for a perfectly refreshing drink. Use a cocktail shaker filled with ice to mix the ingredients well, ensuring a balanced and chilled cocktail. Garnish with a lime wedge for an extra zing! "
    },
    "pornstar_martini": {
        "description": "Chill your glasses and all ingredients beforehand.  Use good quality vodka and fresh lime juice for optimal flavor.  Don't overshake the martini, as it will make it cloudy.  Use a fine-mesh strainer to ensure a smooth, clear drink.  A splash of Prosecco before serving adds a delightful fizz.  Enjoy responsibly! "
    },
    "iced_coffee": {
        "description": "For the perfect Iced Coffee, brew strong coffee and let it cool completely. Use a simple syrup (1:1 sugar and water) for sweetness - it dissolves faster than granulated sugar. Chill your milk for a refreshing touch. Shake everything with ice for a frothy top. Garnish with a sprinkle of cinnamon or cocoa powder for an extra kick. "
    },
    "zombie": {
        "description": "Use high-quality rums for the best flavor. Don't skimp on the 151 proof - it's crucial for the kick!  Measure the Pernod carefully, as it can easily overpower the other flavors. Shake vigorously with ice to chill and meld the ingredients. Garnish with a lime wedge and a cherry for a classic touch.  This drink packs a punch, so warn your guests! "
    },
    "affinity": {
        "description": "This is a variation of a classic, so chill your glassware beforehand. Use good quality Scotch, and measure your vermouths precisely for balance. A dash of orange bitters adds depth, but don't overdo it. Stir with ice, strain into your chilled glass, and garnish with an orange peel for a citrus aroma. "
    },
    "winter_paloma": {
        "description": "**Winter Paloma Tips:*** **Fresh is Best:** Use freshly squeezed grapefruit and lime juice for optimal flavor.* **Pepper Power:**  Add a pinch of freshly ground black pepper to the shaker for a warming kick.* **Sugar Solution:**  Agave syrup provides a smooth sweetness, but you can substitute simple syrup.* **Chill Factor:**  Serve the cocktail chilled for a refreshing winter experience.* **Garnish Game:** A grapefruit wedge and a sprig of rosemary elevate the presentation. "
    },
    "gagliardo": {
        "description": "The Gagliardo is a delicate balance of flavors. Use fresh lemon juice for the best acidity. Don't over-shake, as this will dilute the flavors.  The rose syrup adds a subtle sweetness, so adjust according to your preference.  A good quality peach vodka is essential for a well-rounded cocktail.  Garnish with a lemon twist or a sprig of fresh mint to add a refreshing touch. "
    },
    "quarter_deck_cocktail": {
        "description": "For a balanced Quarter Deck, use a high-quality light rum with a touch of sweetness.  The sherry should be a dry fino or manzanilla for a crisp, nutty note.  Freshly squeezed lime juice is key, and don't be afraid to adjust the sweetness to your liking with a touch of simple syrup.  A light hand with the shake ensures a well-chilled, frothy drink. "
    },
    "nuked_hot_chocolate": {
        "description": "For a perfect Nuked Hot Chocolate, focus on quality ingredients. Use Dutch-processed cocoa powder for a richer flavor.  Don't over-sweeten, start with less sugar and adjust to taste.  A splash of vanilla extract elevates the flavor.  Finally, heat the milk gently on the stovetop instead of microwaving for a smoother, creamier texture. "
    },
    "frozen_daiquiri": {
        "description": "Use a good quality light rum for the best flavor.  Freshly squeezed lime juice is key.  Don't be shy with the sugar - it balances the tartness.  For a truly frozen consistency, use a good amount of ice, blend until smooth, and don't over-blend.  A maraschino cherry garnish adds a classic touch. "
    },
    "masala_chai": {
        "description": "To make a Masala Chai cocktail,  use good quality black tea and fresh spices for maximum flavor.  Steep the spices in water for at least 15 minutes before adding the tea to extract their full essence.  Don't rush the process, simmer the milk gently with the tea and spices to avoid scorching.  Adjust the sweetness to taste.  Strain the chai well before serving,  no one likes a mouthful of cloves!  Enjoy! "
    },
    "tennesee_mud": {
        "description": "For a smooth Tennessee Mud, use freshly brewed coffee, ideally cooled but not cold.  Chill your Jack Daniels and Amaretto beforehand.  When layering, gently pour the Amaretto over the back of a spoon to avoid mixing.  Top with generous whipped cream, but don't over-sweeten the coffee itself.  Serve immediately! "
    },
    "godfather": {
        "description": "Chill your glass beforehand for a truly frosty experience. Use a good quality Scotch, preferably a blended variety, to balance the sweetness of the Amaretto.  A dash of Angostura bitters adds complexity, but is optional. Stir gently with ice to avoid diluting the cocktail too much. Garnish with a lemon twist for a classic touch. "
    },
    "the_laverstoke": {
        "description": "Muddle the lime and ginger aggressively to release their oils. Use a quality gin for a more nuanced flavor profile. When adding tonic water, aim for a gentle pour to avoid over-carbonating the drink. Garnish with a sprig of mint for freshness and visual appeal. Don't forget to taste and adjust the sweetness to your preference.  "
    },
    "tia_maria": {
        "description": "Use high-quality coffee for the best flavor.  Don't over-steep the coffee, as it can become bitter.  For a richer flavor, use dark rum.  Ensure the brown sugar is fully dissolved before adding the rum, as it helps the sweetness meld with the other flavors.  A dash of cinnamon or nutmeg adds a warm complexity. "
    },
    "national_aquarium": {
        "description": "This is a layered drink, so build it carefully. Pour the Rum, Vodka, and Gin first, followed by Blue Curacao. Gently add Sour Mix, then top with Lemon-Lime Soda. Don't stir! The layering creates a visually stunning effect, so go slow and keep it cool.  A light touch with the soda is key to avoid ruining the layering. "
    },
    "loch_lomond": {
        "description": "Chill your glass and ingredients beforehand.  Use a high-quality Scotch for the best flavor.  When twisting the lemon peel, express the oils over the drink for a citrusy aroma.  Stir, don't shake, to avoid diluting the cocktail.  Garnish with the lemon peel for a beautiful and aromatic touch.  Remember, a good Loch Lomond is all about balance between the smoky Scotch, sweet Drambuie, and dry Vermouth. "
    },
    "boston_sour": {
        "description": "Use a dry shake first, without ice, to emulsify the egg white for a foamy head. Add ice for the second shake, ensuring a well-chilled, smooth drink. Use a good quality blended whiskey for a balanced flavor.  Strain the cocktail through a fine-mesh strainer to remove any ice chips or egg white bits. Garnish with a cherry or lemon twist for a classic touch. "
    },
    "white_negroni": {
        "description": "Chill your ingredients well, especially the Lillet Blanc.  Use a good quality gin, and a quality ice cube or large chunk of ice for optimal dilution.  Stir gently but thoroughly for about 30 seconds to ensure proper blending.  Garnish with an orange peel, letting the oils from the zest express over the drink. "
    },
    "sweet_sangria": {
        "description": "To make a killer Sweet Sangria, **start by muddling the fruit**.  This releases the juices and flavors.  Use a good quality red wine, but don't be afraid to use a bit more sugar than you think you need - the fruit will balance it out.  For a refreshing twist, add a splash of Fresca.  Let it chill for at least 2 hours to allow the flavors to meld.  Serve over ice with a garnish of your favorite fruit. "
    },
    "planter’s_punch": {
        "description": "For a perfect Planter's Punch, use a high-quality dark rum with robust flavor.  Freshly squeezed orange and pineapple juice make all the difference.  Don't be shy with the Angostura bitters, a few dashes add complexity.  For a balanced sweetness, adjust the sugar syrup to taste.  Chill all ingredients beforehand for a refreshing drink.  Garnish with a maraschino cherry or a pineapple wedge. "
    },
    "french_75": {
        "description": "For a perfect French 75, use a good quality gin and fresh lemon juice.  Don't skimp on the sugar – it balances the acidity of the lemon and gin.  Shake vigorously with ice to chill thoroughly, then strain into a chilled coupe glass. Top with champagne for a bubbly finish. Garnish with an orange twist and a maraschino cherry for a classic touch. "
    },
    "57_chevy_with_a_white_license_plate": {
        "description": "When making the 57 Chevy with a White License Plate, using a high-quality Crème de Cacao is key for its rich chocolate flavor. Ensure the vodka is chilled for a crisp taste.  Use a cocktail shaker filled with ice and shake vigorously for 15 seconds to properly chill the drink. Strain into a chilled martini glass and garnish with a chocolate curl or a cherry for an elegant touch.  "
    },
    "jam_donut": {
        "description": "To make a Jam Donut cocktail, chill your ingredients for a better, more balanced flavor. Use a good quality sugar syrup, not just granulated sugar, for a smoother, less grainy texture. When layering the cocktail, pour the Chambord gently over the back of a spoon to avoid mixing the layers. Finally, garnish with a fresh raspberry for that perfect, sweet and fruity touch. "
    },
    "bora_bora": {
        "description": "For a balanced Bora Bora, use fresh-squeezed juices whenever possible.  Don't over-shake the cocktail; you want a gentle mix to preserve the delicate flavors. A good tip is to pre-chill the juices and your mixing glass to ensure a refreshing, cold drink.  A rim of sugar or a small pineapple wedge adds a nice touch. "
    },
    "frappé": {
        "description": "For a perfect Frappé, use strong, freshly brewed coffee. Don't skimp on the sugar!  A good ratio is 1:1 coffee to milk, but adjust to your liking. Blend until frothy and smooth, but watch out for ice crystals.  A good tip: Use a blender with a tamper to ensure everything's crushed evenly.  Chill your glasses beforehand for a refreshing treat. "
    },
    "gin_tonic": {
        "description": "Use a large, chilled glass filled with ice. Pour in gin first, followed by tonic. A good ratio is 2 oz gin to 4 oz tonic. Gently stir, then express lemon peel oils over the drink and drop it in. Don't over-garnish, the lemon peel is key to the aroma. "
    },
    "pineapple_gingerale_smoothie": {
        "description": "For a vibrant Pineapple Gingerale Smoothie, use fresh ginger for maximum flavor.  Grate it finely for a subtle heat, or chop it for a more potent kick.  Don't over-blend the pineapple - you want chunks for texture!  Finally, adjust the gingerale to your desired sweetness and fizz level. "
    },
    "tequila_sour": {
        "description": "For a perfectly balanced Tequila Sour, use a good quality reposado tequila.  Shake vigorously with fresh lemon juice and powdered sugar to ensure proper dilution and a frothy top.  Don't over-shake, or you'll have a watery drink.  For a more complex flavor, add a splash of agave nectar.  Finally, garnish with a lemon twist and a maraschino cherry. "
    },
    "brasserie_special": {
        "description": "**Brasserie Special Tips:*** Use a good quality bourbon for a robust base.* Freshly squeeze the lemon juice for optimal flavor.* Shake with ice vigorously to ensure proper dilution and chill.* Strain into a chilled coupe glass for a sophisticated presentation.* Garnish with a passionfruit wedge or a lemon twist. "
    },
    "yoghurt_cooler": {
        "description": "For a smooth Yoghurt Cooler, use a high-quality, thick yogurt for a creamy base. Blend the fruit thoroughly, straining out any seeds or chunks for a smoother texture.  If using citrus fruits, pre-squeeze the juice and strain it before blending to avoid bitter pith.  Don't over-blend the yogurt, as it can become watery.  Adjust the sweetness to your liking with honey or agave.  Serve over ice, and garnish with fresh fruit for a refreshing finish. "
    },
    "bramble": {
        "description": "For a perfect Bramble, use good quality gin and a fresh lemon.  Muddle the sugar syrup and lemon juice thoroughly to release the citrus oils.  Don't over-shake - you want the creme de mure to swirl beautifully.  A good garnish is a blackberry on a skewer, or a lemon twist.  And, of course, a chilled glass is essential! "
    },
    "sea_breeze": {
        "description": "For a perfect Sea Breeze, use high-quality vodka and fresh-squeezed grapefruit juice for a brighter flavor. Don't over-shake, just a gentle swirl to chill and combine. For a sweeter drink, use less grapefruit juice. Garnish with a lime wedge, grapefruit slice, or a sprig of rosemary for a fresh touch. "
    },
    "orange_whip": {
        "description": "For a smooth Orange Whip, use a high-quality rum and vodka.  Ensure the cream is chilled for a thick consistency.  Shake vigorously with ice to thoroughly chill and blend the flavors.  Strain into a chilled coupe glass for a sophisticated presentation. A subtle orange zest garnish adds a fragrant touch. "
    },
    "zinger": {
        "description": "This sounds like a fun and potentially messy combo!  To keep your Zinger balanced, use a light hand with the Surge. It's super sweet, so you don't want to overpower the Peach Schnapps.  A good ratio is 2 parts Schnapps to 1 part Surge.  Shake well with ice to chill, then strain into a chilled coupe glass. Garnish with a lemon twist for a bit of brightness! "
    },
    "maracuya_mojito": {
        "description": "Muddle the mint gently, don't crush it to avoid bitterness.  Use fresh lime juice for the best flavor.  Add the Passionfruit syrup after the rum and lime, as it will balance the sweetness.  Shake vigorously with ice, then strain into a chilled glass. Garnish with a sprig of mint and a lime wheel. "
    },
    "moscow_mule": {
        "description": "Use fresh lime juice, not bottled, for the best flavor.  Chill your copper mugs beforehand.  Add the vodka and lime juice directly to the mug, then top with ginger ale and gently stir.  Use good quality ginger ale for a more complex taste.  Don't overfill the mug; leave room for ice and the ginger ale to fizz.  Garnish with a lime wheel and enjoy! "
    },
    "rum_screwdriver": {
        "description": "Start with a tall glass filled with ice.  Pour in the light rum, then top off with fresh orange juice.  Use a good quality rum, and freshly squeezed orange juice for the best flavor.  Garnish with an orange wedge or a maraschino cherry.  Don't over-shake, as you don't want to dilute the rum too much. "
    },
    "casino": {
        "description": "For a perfect Casino, use a good quality gin and fresh lemon juice. Shake well with ice to ensure a proper chill and dilution.  Don't be afraid to use a generous pour of orange bitters for a complex aroma. A maraschino cherry garnish is essential, but opt for a high-quality one for a richer flavor. "
    },
    "notorious_fig": {
        "description": "Use a good quality fig syrup, preferably homemade for a richer flavor.  Don't skimp on the Amaro, its herbal complexity balances the sweetness and whiskey.  Paychaud's Bitters adds a subtle but important spicy kick.  Chill the ingredients before mixing for a refreshing, well-balanced drink.  Garnish with a fig slice or sprig of rosemary for an extra touch of elegance. "
    },
    "mary_pickford": {
        "description": "Use fresh pineapple juice for the best flavor. Don't overshake the cocktail, as it will become cloudy. A gentle shake with ice is ideal. Use a good quality maraschino liqueur, as it adds a key element of sweetness and complexity. A dash of grenadine creates a beautiful color gradient. "
    },
    "chicago_fizz": {
        "description": "For a perfect Chicago Fizz, start with a chilled glass. Dry shake the rum, port, lemon, sugar, and egg white vigorously for 30 seconds to build a frothy head. Add ice and shake again for a frosty cocktail. Finally, top with carbonated water for a bubbly finish. Remember, a light touch with the sugar is key to avoid a cloying sweetness. "
    },
    "orgasm": {
        "description": ""
    },
    "vodka_slime": {
        "description": "For a truly refreshing Vodka Slime, use fresh lime juice, not bottled.  It makes all the difference!  Shake hard with ice to ensure proper chilling and dilution.  Don't over-pour the vodka, as it should be a subtle presence.  And most importantly, rim your glass with sugar for that extra touch of sweetness! "
    },
    "camerons_kick": {
        "description": "When making Cameron's Kick, use a good quality Irish whiskey and a robust blended scotch. The orgeat syrup adds sweetness and a subtle almond flavor, so don't overpower it with too much lemon juice. Shake vigorously with ice to chill and dilute the mixture.  Strain into a chilled coupe glass and garnish with a lemon twist. "
    },
    "bumble_bee": {
        "description": "The Bumble Bee is a layered cocktail, so precision is key.  Chill your glasses thoroughly and use a bar spoon to slowly pour each liqueur, starting with the heaviest (Baileys), followed by Kahlua, and finish with the lightest (Sambuca).  Don't stir! The layers are the beauty of the drink. A gentle pour and a steady hand will create a stunning visual that's as delicious as it looks. "
    },
    "vodka_lemon": {
        "description": "For a vibrant Vodka Lemon, use fresh lemon juice and a generous twist of peel for maximum citrus aroma.  Muddle the peel gently to release oils, but avoid bitterness.  Shake vigorously with ice to chill and dilute, ensuring a crisp, refreshing drink.  Strain into a chilled glass and garnish with a lemon wedge.  Enjoy! "
    },
    "cosmopolitan": {
        "description": "For a perfect Cosmo, chill everything - your shaker, ingredients, and even the glass.  Use fresh lime juice, not bottled.  Measure carefully, as a little too much cranberry juice can make it overly sweet.  Shake hard with ice to chill thoroughly, then strain into a chilled martini glass.  Garnish with a lime twist for a classic touch. "
    },
    "figgy_thyme": {
        "description": "Muddle the figs and thyme thoroughly to extract their flavors. Use a good quality vodka, and don't be afraid to let the honey syrup shine. A dash of Angostura bitters adds complexity, while tonic water brings a refreshing fizz.  Use a nice glass, and garnish with a fig slice and thyme sprig.  Enjoy! "
    },
    "imperial_fizz": {
        "description": "For a perfect Imperial Fizz, use a high-quality light rum and a balanced blended whiskey.  Shake the cocktail well with ice to chill and dilute it properly.  Don't over-shake - you want a fluffy, foamy head, not a slush.  Use a fine-mesh strainer to remove any ice shards.  Finally, top with a splash of carbonated water to give it that fizzy, refreshing finish. "
    },
    "hawaiian_cocktail": {
        "description": "Use a high-quality gin for a brighter flavor profile.  Chill all ingredients beforehand for a refreshing drink.  Shake vigorously with ice to ensure proper dilution and a silky texture.  Strain into a chilled coupe glass and garnish with a pineapple wedge or a sprig of mint for an aromatic touch.  "
    },
    "brain_fart": {
        "description": ""
    },
    "busted_pipe": {
        "description": "Use a good quality bourbon, as it's the star of the show. Don't be shy with the Amaro – it adds complexity. A few dashes of each bitters are enough to add depth without overwhelming.  Stir the drink well with ice to chill and dilute slightly. Garnish with an orange peel, expressing the oils over the drink. "
    },
    "whiskey_rosa_sour": {
        "description": "For a perfect Whiskey Rosa Sour, use a high-quality bourbon and fresh lemon juice. Shake vigorously with ice to chill and emulsify the ingredients. The gum syrup adds body and sweetness, so adjust it to your preference. A dash of orange bitters elevates the flavor profile. Finally, strain into a chilled coupe glass and garnish with a lemon twist for a beautiful and delicious cocktail. "
    },
    "3_mile_long_island_iced_tea": {
        "description": "This is a deceptively potent drink.  Don't be fooled by the tea name; it's a serious cocktail.  Use a good quality soda for best results.  Be precise with measurements, as adding too much of one spirit can make the drink unbalanced.  A good bartender will know how to balance all of the flavors and create a delicious and potent cocktail. "
    },
    "rum_runner": {
        "description": "Start by chilling your glass. This keeps the drink cold and refreshing. Use fresh juices for the best flavor.  To avoid over-diluting, build the drink in the glass with ice.  If using pre-mixed juices, adjust the amount of cranberry juice to your preference - less for a sweeter drink. Garnish with a fresh blackberry or orange peel. "
    },
    "mojito_extra": {
        "description": "Muddle the mint gently, don't pulverize it. Use fresh lime juice, not bottled. A good quality dark rum is essential.  Add the club soda just before serving to keep the fizz.  A dash of bitters balances the sweetness and adds complexity.  Garnish with a mint sprig and a lime wheel. "
    },
    "monongahela_mule": {
        "description": "Muddle the mint gently to release its flavor, but avoid bruising it.  Use fresh lemon juice for the best tang, and make sure your ginger syrup is spicy and your raspberry syrup is tart.  Shake vigorously with ice for a good chill and frothy head. Top with soda for a refreshing fizz. Enjoy responsibly! "
    },
    "cherry_rum": {
        "description": "Use a high-quality light rum for a clean base.  Ensure the cherry brandy is sweet and fruity, not too bitter.  Shake with ice to chill thoroughly, then strain into a chilled glass. A light touch with the cream is key: a small amount adds richness without overpowering the rum and cherry. Garnish with a cherry or a cherry-infused sugar rim. "
    },
    "acid": {
        "description": "This sounds like a dangerous mix.  Please be careful and never drink and drive.  If you're going to make this drink, I recommend chilling the Wild Turkey and using a high-quality 151 Proof Rum.  Also, add the rum slowly, as it's very potent.  This is a strong cocktail, so be mindful of your limits.  Drink responsibly! "
    },
    "egg_nog_classic_cooked": {
        "description": "For a smooth, silky egg nog, temper your eggs gently.  Whisk yolks with sugar and salt until pale, then slowly drizzle in hot milk, whisking constantly to prevent curdling.  Simmer until thickened, stirring frequently. Cool completely before adding vanilla and chilling.  Don't overcook; it'll become grainy.  Use fresh, high-quality ingredients for the best flavor! "
    },
    "lassi_raita": {
        "description": "Use thick, Greek-style yogurt for a creamy texture.  Pulse the ice in a blender before adding the yogurt to ensure a smooth consistency.  Start with a pinch of salt and adjust to taste, remembering that salt enhances sweetness.  Freshly squeezed lime juice is key for a bright, balanced flavor.  Chill the ingredients beforehand for a refreshing drink.  "
    },
    "english_highball": {
        "description": "For a perfect English Highball, chill your glass and ingredients beforehand. Use high-quality brandy and gin, and a touch of sweet vermouth for complexity. Don't over-shake, as you want a light, refreshing drink. Garnish with a lemon peel twist, expressing the oils over the cocktail for aroma.  "
    },
    "zorbatini": {
        "description": "The Zorbatini's key is balance.  Chill your vodka and ouzo separately for the best taste.  Use a good quality ouzo for its anise flavor, but start with a 1:1 ratio and adjust to your taste.  Shake with ice to chill, but strain into a chilled martini glass to avoid dilution.  Garnish with a lemon twist or a cocktail olive for a Greek twist. "
    },
    "boxcar": {
        "description": "The Boxcar is a classic, but mastering the egg white is key.  Dry shake vigorously to emulsify the white and build a frothy head.  Then, add ice and shake again.  This creates a velvety texture.  Strain into a chilled coupe for a beautiful, clear presentation.  Don't forget a cherry garnish for a touch of sweetness! "
    },
    "addington": {
        "description": "The Addington is a delicate balance of sweet and dry.  Chill your vermouths thoroughly before mixing.  Use a good quality soda water for a crisp finish.  Don't over-ice, let the vermouths shine.  A subtle touch of orange bitters can add complexity.  Serve in a chilled coupe for an elegant presentation. "
    },
    "vodka_and_tonic": {
        "description": "Chill your vodka and tonic water well. Use a highball glass filled with ice. Pour vodka first, then tonic, creating a gentle fizz. Garnish with a lime wedge and a sprig of fresh mint for a refreshing touch. A citrus twist over the drink will also release aromatic oils for a richer experience.  "
    },
    "casa_blanca": {
        "description": "For a perfect Casa Blanca, chill your ingredients beforehand. Use fresh lime juice for optimal flavor. Shake vigorously with ice to ensure proper dilution and a frosty, refreshing drink. Strain into a chilled coupe glass. Don't skimp on the Maraschino liqueur; it adds a delightful complexity. Garnish with a lime wheel for a touch of elegance. "
    },
    "the_galah": {
        "description": "To make The Galah shine, prioritize freshness. Use high-quality dark rum for depth and a good Campari for its bitter bite.  Shake your cocktail well with ice to thoroughly chill and dilute it.  This helps balance the sweetness of the creme de banane and pineapple juice.  Finish with a lime wheel for a vibrant touch. "
    },
    "barracuda": {
        "description": "Shake the rum, Galliano, pineapple and lime juices with ice. Strain into a chilled coupe glass. Top with Prosecco and garnish with a lime wheel. Use a high-quality white rum and fresh juices for the best flavor.  Don't overshake - you want a light, frothy head on your drink.  And lastly,  enjoy the tropical sunshine in a glass! "
    },
    "blackberry_smash": {
        "description": "Muddle the blackberries and mint gently to release their flavors, but avoid crushing the seeds.  Use a good quality bourbon or rye whiskey for a more robust flavor.  Adjust the gum syrup to your liking - it can be used to balance the tartness of the lemon and sweetness of the berries.  Don't over-shake, a light shake will keep the drink refreshing. Garnish with a fresh blackberry and a sprig of mint. "
    },
    "pimms_cup": {
        "description": "Use fresh, muddled mint and cucumber for the best flavor. Don't over-muddle, just bruise the ingredients to release their oils.  Let the Pimms sit in the glass with the other ingredients for at least 5 minutes to chill and meld flavors.  Top with a generous pour of lemonade, adjusting to your taste.  Don't forget the garnishes - a sprig of mint, a strawberry and a cucumber ribbon add visual appeal and freshness. "
    },
    "gin_and_soda": {
        "description": "A good Gin & Soda is all about balance. Use a high-quality gin with a distinct character. Fill your glass with ice first, then add the gin and a good squeeze of fresh lime juice. Top with chilled soda water, keeping the bubbles lively. Garnish with a lime wheel and enjoy the refreshing simplicity! "
    },
    "michelada": {
        "description": "Use a good quality lager for the Michelada.  Chill all ingredients, especially the beer.  Start with a small amount of hot sauce and adjust to your desired spice level.  A pinch of salt enhances the flavor.  Mix the tomato juice, lime juice, hot sauce, Worcestershire, and soy sauce in a separate glass before adding to the beer.  Serve with a lime wedge and a pinch of chili powder for garnish. "
    },
    "moranguito": {
        "description": "This is a complex flavor profile!  When making Moranguito, use high-quality absinthe for a strong anise flavor. Chill your tequila to enhance its smoothness and prevent the grenadine from diluting it too much.  Use a good quality grenadine, but be mindful of the sweetness it adds.  Start with a small amount and adjust to taste.  A good garnish is a sprig of fresh mint or a lime wheel. "
    },
    "lone_tree_cooler": {
        "description": "Chill your glass and ingredients beforehand for a truly refreshing drink.  Use high-quality gin and vermouth for best flavor.  Gently muddle the powdered sugar with a splash of water to create a simple syrup, avoiding any lumps.  When adding the orange spiral, use a citrus peeler to create a beautiful curl for garnish.  Finally, use a bar spoon to gently stir the cocktail, keeping the carbonation intact. "
    },
    "hot_creamy_bush": {
        "description": "For a smooth, creamy Hot Creamy Bush, start by warming your Irish whiskey and coffee gently. Don't boil! Add Baileys last, stirring gently to avoid over-mixing and creating a foamy mess. Garnish with a sprinkle of cinnamon or nutmeg for a touch of warmth.  Enjoy! "
    },
    "homemade_kahlua": {
        "description": "To create the perfect homemade Kahlua, focus on high-quality coffee. Brew a strong, fresh pot, let it cool, and use a fine-mesh strainer for a smooth texture. Don't be afraid to experiment with vanilla extract - a few drops go a long way! Let your mixture steep for at least 24 hours to develop complex flavors. Adjust sweetness to your taste, and store in a cool, dark place. "
    },
    "espresso_martini": {
        "description": "For a perfect Espresso Martini, use freshly brewed espresso, not instant. Shake hard with ice to chill and emulsify the ingredients. A good shake creates a silky smooth texture. Strain into a chilled martini glass for an elegant presentation. Garnish with coffee beans for a touch of sophistication. "
    },
    "avenue_scotch": {
        "description": "For a balanced Avenue Scotch, prioritize fresh, high-quality ingredients. Use a good quality blended Scotch with a bit of peat for complexity.  Measure your syrups precisely – a little goes a long way.  Shake vigorously with ice to chill and emulsify, then double strain for a crystal-clear presentation. Garnish with a lime wheel and a sprig of fresh mint. "
    },
    "sazerac": {
        "description": "Chill your glass! A pre-chilled glass enhances the experience. Use a good quality rye whiskey and absinthe. Stir your Sazerac with ice, not shake, to avoid dilution.  Don't be afraid to adjust the bitters to your preference.  Rinse your glass with absinthe, but not too much, you want the flavor, not a mouthful of it.  Garnish with a lemon twist. Enjoy! "
    },
    "havana_cocktail": {
        "description": "To make a Havana Cocktail sing, use fresh-squeezed juices for the brightest flavors.  Chill the ingredients beforehand, ensuring the pineapple juice is well-strained to avoid cloudy cocktails. Shake hard with ice to create a perfectly chilled and frothy drink. Garnish with a pineapple wedge for a tropical touch."
    },
    "lukas_grog": {
        "description": "To nail the Lukas Grog, start with a fresh squeeze of lime, ensuring the juice is bright and tart.  Use a high-quality dark rum for depth and a smoky rum for a unique twist. The passionfruit syrup should be homemade for a more complex flavor.  Shake everything vigorously with ice, double-strain to remove any pulp, and garnish with a lime wheel and a sprig of mint."
    },
    "grim_reaper": {
        "description": "This drink packs a punch! Use a chilled mixing glass for a super-cold serve. Measure carefully – a little 151 goes a long way! Shake with ice and strain into a chilled coupe or martini glass.  For a layered effect, gently pour grenadine over ice after shaking.  Serve with a cherry, and a warning – it's strong! "
    },
    "tipperary": {
        "description": "When crafting a Tipperary, remember the green Chartreuse is the star. Use a good quality Irish whiskey for depth, but let the Chartreuse shine. Chill the vermouth and Chartreuse beforehand for a crisp, balanced flavor.  Don't over-shake; a gentle stir preserves the delicate aromatics.  Garnish with a lemon twist for a citrusy accent. "
    },
    "owens_grandmothers_revenge": {
        "description": "Start with a good quality whiskey, it's the star of the show. Use a beer that complements the whiskey, a pale ale or IPA work well. Freshly squeezed lemonade adds brightness, so don't be shy with the citrus.  Use a tall glass filled with ice to keep the drink chilled, and don't over-mix - you want a layered, balanced cocktail, not a beer-slushy.  Enjoy! "
    },
    "747": {
        "description": "The 747 is a layered drink, so technique is key. Chill your glasses beforehand.  Pour the Kahlua in first, followed by Baileys slowly, aiming for the side of the glass to keep it separate.  Top with Frangelico gently, as it's the lightest and floats.  A bar spoon can help guide the heavier liqueurs down. "
    },
    "grasshopper": {
        "description": "For a perfect Grasshopper, use quality crème de menthe and cacao.  Chill all ingredients beforehand for a frosty, refreshing drink.  Shake well with ice, ensuring the cream is thoroughly blended.  Strain into a chilled coupe glass, and garnish with a sprig of fresh mint for a touch of elegance.  "
    },
    "lemon_elderflower_spritzer": {
        "description": "Use a good quality elderflower cordial for best flavor.  Chill all ingredients, including the glass, for optimal refreshment.  Start with a light hand on the vodka, you can always add more! Gently stir the ingredients to avoid diluting the soda water too quickly. Garnish with a lemon wheel or sprig of fresh mint for a touch of elegance.  "
    },
    "old_fashioned": {
        "description": "Use a large ice cube or sphere for slow dilution.  Muddle the sugar and bitters with a splash of water, not the bourbon, for a more balanced sweetness.  Don't over-stir, aim for a well-chilled cocktail, not a diluted one.  Garnish with a flamed orange peel, expressing the oils over the drink for aroma. "
    },
    "old_cuban": {
        "description": "Chill your glass and ingredients, especially the Prosecco, for a crisp, refreshing experience. Muddle the lime and sugar syrup gently to avoid bitterness. Use a good quality white rum with a bit of spice for complexity. Build the cocktail in the glass, topping with Prosecco to maintain its effervescence. A twist of lime adds a touch of elegance. "
    },
    "frozen_mint_daiquiri": {
        "description": "For a killer Frozen Mint Daiquiri, muddle the mint gently to release its oils, not pulverize it. Use a good quality light rum, and adjust sugar to your taste.  Don't over-blend, as it can become icy. A fine ice consistency is key. Garnish with a sprig of mint and a lime wheel. "
    },
    "apple_kickin": {
        "description": "To ensure a balanced Apple Kickin,  use a high-quality Japanese whisky with a smooth, slightly sweet profile.  Don't overpower the apple notes by going heavy on the Amaro - a small dash is all you need.  A few drops of aromatic bitters will enhance the complexity of the drink.  Shake well with ice to chill and dilute the syrup, then strain for a crisp, refreshing cocktail. "
    },
    "vesper": {
        "description": "For a perfect Vesper, chill your glassware and all ingredients, especially the Lillet Blanc. Use a good quality gin and vodka, and measure precisely.  Shake vigorously with ice to thoroughly chill the drink, then double strain for a crystal clear result. Garnish with a lemon twist and express the oils over the drink before discarding. "
    },
    "horses_neck": {
        "description": "For a perfect Horse's Neck, chill your glass and brandy beforehand. Use a good quality brandy with strong notes. Don't over-muddle the lemon peel - just express its oils over the drink. Gently pour the ginger ale to maintain its fizz, and add just a dash of bitters for complexity. Finally, garnish with a long, curled lemon peel. "
    },
    "flying_scotchman": {
        "description": "For a Flying Scotchman, chilling is key.  Use a chilled glass, pre-chill your Scotch and vermouth.  Don't skimp on the bitters, they add complexity.  A dash of sugar syrup helps balance the dryness of the Scotch and vermouth.  A gentle stir, not a shake, ensures a smooth, sophisticated drink."
    },
    "rose": {
        "description": "For a perfect Rose, chill your ingredients, especially the vermouth and gin. Use a good quality dry vermouth for a complex flavor. Don't over-shake the cocktail, a gentle shake will preserve the delicate balance of flavors.  A touch of powdered sugar on the rim adds sweetness and a visually appealing touch. "
    },
    "kir": {
        "description": "For a perfect Kir, chill both the Creme de Cassis and Champagne beforehand.  A splash of Cassis is key – use a 1:10 ratio of Cassis to Champagne. Gently pour the Cassis into the chilled Champagne flute, then top with the Champagne.  Avoid stirring, as this can diminish the bubbly.  Garnish with a blackcurrant or a lemon twist for an elegant touch. "
    },
    "corn_n_oil": {
        "description": "To make a great Corn n' Oil, remember these tips: * **Start with good quality ingredients:** Use fresh lime juice and high-quality rums.* **Measure carefully:** This cocktail is balanced, so precise measurements are key. * **Shake well with ice:** This chills the drink and dilutes it properly. * **Strain into a chilled coupe glass:** This keeps the drink cool and enhances the aroma. * **Garnish with a lime wheel:** It adds a touch of freshness and elegance. "
    },
    "funk_and_soul": {
        "description": "For a vibrant Funk and Soul, use fresh lemon juice and high-quality rum.  Chill the ingredients beforehand for a refreshing drink. Shake the rum, apricot nectar, pomegranate juice, and lemon juice with ice. Double-strain into a chilled coupe glass for a crystal-clear finish. Top with soda water for a bubbly delight.  Garnish with a lemon twist or pomegranate seeds. "
    },
    "dubonnet_cocktail": {
        "description": "Chill your Dubonnet and gin beforehand for a perfectly crisp cocktail. Use a good quality gin, like a London Dry, for a balanced flavor.  A dash of Angostura bitters adds complexity, but don't overdo it.  Express the lemon peel over the drink for a bright citrus aroma, then discard the peel.  Garnish with a lemon twist for a classic touch. "
    },
    "paloma": {
        "description": "For a perfect Paloma, use a good quality tequila - reposado or anejo adds complexity.  Chill your ingredients well.  Don't just shake, muddle a lime wedge for extra aroma and flavor.  Use a highball glass filled with ice for maximum dilution.  Top with a generous amount of grapefruit soda, and garnish with a lime wheel. "
    },
    "pop_quiz": {
        "description": "This cocktail is a delicious blend of sweetness, spice, and bitter notes. Here's a tip: use a high-quality bourbon for the best flavor. To enhance the chocolate notes, consider using a chocolate-flavored bitters, such as Angostura Chocolate Bitters.  For a more intense flavor, use a concentrated gum syrup or adjust the amount to your preference.  Finally, chill the cocktail thoroughly before serving for a truly refreshing experience. "
    },
    "japanese_fizz": {
        "description": "This drink is all about the silky texture.  When shaking, use a dry shake (without ice) to froth the egg white first, then add ice for a proper chill.  Don't over shake, it can get foamy.  Use a fine mesh strainer to ensure a clean, smooth texture.  A touch of bitters can add a nice depth of flavor.  "
    },
    "jelly_bean": {
        "description": "When crafting the Jelly Bean, the key is balance.  Start with a good quality blackberry brandy, its sweetness should be noticeable.  Use a subtle touch of anise, just enough to add a hint of licorice without overwhelming the fruit.  Chill the ingredients and serve the cocktail in a coupe glass, a small amount of ice is fine but avoid over-diluting the drink. "
    },
    "chocolate_milk": {
        "description": "For the perfect Chocolate Milk, use high-quality chocolate liqueur for a rich, complex flavor.  Chill the milk beforehand for a smoother, creamier texture. Shake vigorously with ice to emulsify the ingredients and create a frothy top. Adjust sweetness to taste with a touch more Amaretto. Garnish with a chocolate curl or sprinkle for an elegant touch. "
    },
    "quick_f**k": {
        "description": "This is a sweet, creamy cocktail that's best enjoyed chilled.  Use a cocktail shaker with ice for optimal chilling.  Start with a layer of Kahlua for its coffee flavor, then carefully layer the Midori, followed by the Baileys. This creates a visually appealing gradient. Don't over shake as you want to preserve the layers. Garnish with a lime wheel or a sprinkle of cocoa powder. "
    },
    "rhyme_or_reason": {
        "description": "When making the Rhyme or Reason cocktail, focus on the balance.  Ensure the Blood Orange Cordial sweetness complements the rye's spice, while the Orgeat adds a subtle almond note.  Use fresh lime juice for that bright acidity.  Shake hard with ice to chill and dilute the mix, then strain into a chilled coupe.  Garnish with a blood orange wheel for a beautiful presentation. "
    },
    "shot_gun": {
        "description": ""
    },
    "501_blue": {
        "description": "When crafting a 501 Blue, prioritize layering for visual appeal. Pour the Blue Curacao first, followed by the Blueberry Schnapps for a vibrant gradient. Gently add the vodka and sour mix, then top with 7-Up.  A light shake with ice before pouring will ensure a chilled and balanced drink. Garnish with a blueberry for an extra touch. "
    },
    "coke_and_drops": {
        "description": "This is a super simple drink, but there are a few things to keep in mind. First, use fresh lemon juice. It makes a world of difference. Second, don't overpower the Coke. Start with just a few drops of lemon juice and taste as you go. You can always add more!  Lastly, a splash of Angostura bitters adds a nice complexity."
    },
    "tanglin_club": {
        "description": "To make a perfect Tanglin Club, ensure your passionfruit syrup is homemade for the freshest flavor. Use a good quality gin and dry vermouth. Shake vigorously with ice to chill and dilute properly.  A good quality aromatic bitters adds complexity, but don't overdo it.  Finish with a fresh lime wheel for a citrusy aroma. "
    },
    "lunch_box": {
        "description": "Start with a chilled glass to keep the drink cool. Pour the Amaretto first, then the beer (use a good quality lager or pale ale). Finish with the orange juice, layering it gently on top. Don't stir, as you want the flavors to remain separate. Garnish with an orange slice or wheel. "
    },
    "munich_mule": {
        "description": "Muddle cucumber and lime juice in a copper mug to release their oils and flavors.  Don't over-muddle!  Use a high-quality gin for a brighter, more botanical flavor.  Top with chilled ginger beer, not ice, and a squeeze of lemon for a touch of acidity. Garnish with a cucumber ribbon for a beautiful presentation. "
    },
    "big_red": {
        "description": "This is a simple, but powerful drink. To achieve the right balance, chill your glasses beforehand. Pour the Irish Cream first, allowing its sweetness to dominate. Gently layer the Goldschlager on top – its cinnamon and gold flakes create a stunning visual. Serve with a cinnamon stick for a final touch of warmth. "
    },
    "sourise": {
        "description": "When making the Sourise, prioritize fresh ingredients. Use a good quality cognac for depth and raspberry gum syrup for sweetness.  Don't be afraid to adjust the lemon juice to your liking. Shake vigorously with ice to chill and emulsify the flavors. Double-strain to remove any ice shards or gum syrup chunks. Finally, garnish with a lemon twist for a refreshing touch. "
    },
    "derby": {
        "description": "Muddle the mint gently, just enough to release oils, not pulverize it. Use a quality gin with botanicals that complement the peach and mint, like juniper and citrus. A dash of peach bitters is key, not too much! Build the drink over ice, ensuring the gin is chilled, and garnish with a fresh mint sprig. The Derby is best enjoyed fresh, so avoid over-mixing. "
    },
    "new_york_sour": {
        "description": "Use a good quality blended whiskey for a more complex flavor. Freshly squeezed lemon juice is key.  Dissolve the sugar in the lemon juice to avoid gritty syrup.  Pour the red wine slowly over the back of a spoon to create a distinct layer. Garnish with a cherry or lemon twist. Don't over-shake, as it can make the drink too cloudy."
    },
    "diesel": {
        "description": "For a balanced Diesel, start with a good quality lager.  Use a high-quality blackcurrant cordial, as its flavor will be prominent.  Don't be afraid to adjust the cider ratio to your taste.  A splash of lemon juice adds brightness, and a blackcurrant garnish adds a touch of elegance.  Chill all ingredients before mixing to ensure a refreshing drink. "
    },
    "deep_south": {
        "description": "When making the Deep South, ensure your peach syrup is fresh and flavorful.  Use a good quality mezcal for smokiness, and balance the rye with a quality, tart lemon juice.  Shake hard with ice to chill thoroughly, and double-strain for a pristine presentation.  Garnish with a lemon twist or a fresh peach slice. "
    },
    "coffee_vodka": {
        "description": "To make a perfect Coffee-Vodka, focus on the coffee. Use freshly brewed, strong coffee for the best flavor.  Don't overdo the sugar, as the coffee itself should be the dominant sweetness. A touch of vanilla extract enhances the coffee's aroma. Caramel coloring is optional, but a good quality one will ensure a beautiful hue.  Finally, chill all ingredients beforehand for a refreshing, smooth cocktail. "
    },
    "pink_moon": {
        "description": "Muddle the blackberries gently to release their juices, but avoid crushing the seeds. Use a good quality gin for a brighter flavor.  Chill all ingredients beforehand for a perfectly refreshing cocktail. Shake well with ice to ensure proper dilution and a silky texture. Garnish with a blackberry and a lime wheel."
    },
    "white_lady": {
        "description": "For a perfect White Lady, chill your glass and ingredients beforehand. Shake vigorously with ice to ensure proper dilution and a frosty texture. Use fresh lemon juice for optimal flavor. Strain into the chilled glass and garnish with a lemon twist.  Don't over-shake or you'll get a cloudy cocktail. "
    },
    "death_in_the_afternoon": {
        "description": "**Chill your champagne thoroughly.** Absinthe is already chilled, so you want the champagne to be as cold as possible to keep the drink refreshing.  **Use a high-quality absinthe.**  This is the star of the show!  **Pour the absinthe first, then top with champagne.** This ensures proper layering and preserves the absinthe's aroma. **Garnish with a sugar cube or a lemon twist** for an elegant touch. "
    },
    "godchild": {
        "description": "For a smooth Godchild, use a good quality vodka and Amaretto.  Chill the heavy cream beforehand for a richer, velvety texture.  Shake well with ice, but strain into a chilled glass to avoid any ice shards.  Garnish with a touch of grated nutmeg for a warm, festive touch. "
    },
    "allegheny": {
        "description": "For a perfect Allegheny, chill your glassware beforehand.  Use a good quality dry vermouth, and don't be afraid to go heavy on the blackberry brandy - it's the star of the show.  Freshly squeezed lemon juice is key, and a twist of lemon peel adds an elegant touch.  Shake vigorously with ice to chill thoroughly, then strain into your chilled glass.  Enjoy! "
    },
    "highland_fling_cocktail": {
        "description": "This classic cocktail is all about balance. Chill your glass beforehand. Use good quality Scotch and vermouth.  A dash of orange bitters elevates the flavor, but don't overdo it. Stir with ice, not shake, to avoid dilution. Garnish with an olive or a twist of orange peel.  Remember, a good Highland Fling should be both refreshing and complex. "
    },
    "lassi_a_south_indian_drink": {
        "description": "For a perfect Lassi, use **full-fat yogurt** for richness. **Freshly ground cumin** provides the most flavor, so grind it yourself. **Chill everything** before blending to ensure a cool, refreshing drink. Use a **powerful blender** to achieve a smooth consistency. Adjust the **water and salt** to your taste preference, and don't forget the **mint garnish** for a beautiful finish! "
    },
    "zoksel": {
        "description": "This sounds like a fun, layered cocktail!  Start with the heaviest ingredients at the bottom: Creme de Cassis, then lemonade, and root beer.  Use a bar spoon to carefully layer the beer, Coca-Cola, and 7-Up to avoid mixing.  Finish with a squeeze of lemon juice and a lemon twist for a bright touch. Remember to chill all ingredients beforehand for a perfectly refreshing experience. "
    },
    "cranberry_punch": {
        "description": "For a vibrant Cranberry Punch, use high-quality cranberry juice for the best flavor. Adjust sugar to your preference, starting with a little and tasting as you go.  Use a good quality almond extract for a subtle nutty flavor.  Don't over-mix the ginger ale, as it will lose its fizz.  Chill everything beforehand for a refreshing drink! "
    },
    "manhattan": {
        "description": "Chill your glass beforehand for a perfect chill. Use a good quality bourbon and sweet vermouth.  Don't be afraid to experiment with the ratio of vermouth to bourbon to find your perfect balance. A dash of Angostura bitters is key, but don't overdo it!  Garnish with a cherry and a twist of orange peel for a beautiful presentation. "
    },
    "rosemary_blue": {
        "description": "Muddle rosemary sprigs gently to release oils, but don't bruise them.  Use a good quality gin for a balanced flavor. For a stronger rosemary flavor, use fresh rosemary.  Chill all ingredients before mixing to ensure a refreshing drink.  Garnish with a rosemary sprig and a lime wedge. "
    },
    "long_island_iced_tea": {
        "description": "The key to a great Long Island Iced Tea is balance.  Use equal parts of each spirit, around 1/2oz each.  Avoid over-pouring the Coca-Cola - it should just top the drink. A good quality lemon peel will make a difference, so use a fresh one and express the oils over the drink before dropping it in.  Don't forget the ice! It's a powerful drink, so enjoy responsibly. "
    },
    "sweet_bananas": {
        "description": "For a velvety smooth Sweet Bananas, use ripe bananas for maximum sweetness and flavor. Blend them thoroughly with milk until completely smooth. A touch of honey adds depth, so start with a teaspoon and adjust to your taste.  Chill the mixture for optimal refreshment.  For a fancier presentation, rim the glass with crushed banana chips. "
    },
    "blackthorn": {
        "description": "For a perfect Blackthorn, use a high-quality, dry Sweet Vermouth for balance.  Chill both the vermouth and sloe gin before mixing.  Ensure the lemon peel is zested, not muddled, to avoid bitterness.  Use a good quality sloe gin, as its flavor is key.  Stir, don't shake, to keep the cocktail elegant and maintain the vermouth's aromatic complexity. "
    },
    "pysch_vitamin_light": {
        "description": "This sounds like a refreshing, fruity concoction! To make it perfect, chill your juices beforehand to ensure a cold, crisp taste. Use a good quality orange juice with a bit of pulp for texture.  Start with a base of ice and then layer the juices –  orange, apple, then pineapple.  Give it a gentle stir to combine, but don't overmix as you want to preserve the natural sweetness of the juices. "
    },
    "lady_love_fizz": {
        "description": "For a perfect Lady Love Fizz, the key is a smooth, frothy texture. Dry shake the gin, cream, sugar, lemon, and egg white vigorously for 30 seconds to emulsify the egg white. Then, add ice and shake again for 15 seconds. Double strain to remove any ice shards. Top with carbonated water for a delightful fizz. "
    },
    "old_pal": {
        "description": "For a perfect Old Pal, use a good quality rye whiskey and a dry vermouth with a hint of bitterness.  Chill all your ingredients beforehand, as this will help the drink stay cold and refreshing.  Use a barspoon to carefully stir the ingredients with ice, ensuring a well-balanced cocktail.  Strain into a chilled coupe glass, garnish with an orange peel, and enjoy! "
    },
    "kiwi_papaya_smoothie": {
        "description": "To make your Kiwi Papaya Smoothie a delight, start with ripe, flavorful fruits.  Don't over-blend, you want a slightly chunky texture. For a vibrant color, use a quality green kiwi. A splash of lime juice adds brightness, and a touch of honey balances the sweetness. Serve chilled and garnish with a fresh kiwi slice for an extra touch. "
    },
    "mr_black_espresso_martini": {
        "description": "Use high-quality cold brew for the best flavor. Shake vigorously with ice to chill and emulsify the cocktail.  Don't over-shake, as it can dilute the coffee.  Strain into a chilled martini glass for a perfect presentation.  A sprinkle of coffee beans or a thin slice of orange peel adds a touch of elegance. "
    },
    "port_wine_flip": {
        "description": "This is a classic, so use fresh ingredients. Separate the egg white and yolk,  whip the white separately until stiff peaks form. This creates a rich, frothy head. Fold the yolk mixture into the whipped white gently, don't overmix.  Chill the port before combining to prevent the egg from cooking.  Don't shake this drink, just stir gently to avoid over-diluting. "
    },
    "3_wise_men": {
        "description": "This is a bold, complex drink so balance is key.  Use high-quality ice to prevent watering down.  Don't overshake - a few gentle shakes will integrate the flavors without bruising the ice.  Taste after each shake and adjust the ratio to your liking.  A touch of bitters can add depth, and a lemon twist for garnish brings a fresh element.  Enjoy! "
    },
    "b_53": {
        "description": "The B-53 is a sweet, layered cocktail with a kick. To achieve the distinct layers, pour slowly and carefully. Use a bar spoon to gently push the Sambuca to the bottom, then the Grand Marnier, leaving the Kahlua on top.  A slow pour with a gentle hand is key!  This creates the visual appeal and allows each liqueur to maintain its distinct flavor profile.  Garnish with a lemon twist or a coffee bean for a nice touch. "
    },
    "penicillin": {
        "description": "To make a perfect Penicillin, ensure your ginger syrup is fresh and strong, balancing the honey sweetness. Use a good quality blended Scotch as a base, and a peaty Islay for the kick. Don't overshake, you want a slightly cloudy texture, not a frothy one.  A splash of soda water can add a refreshing touch, but it's optional.  Finally, a nice garnish of a ginger wheel or candied ginger is a must. "
    },
    "vampiro": {
        "description": "For a perfect Vampiro, balance is key. Use a high-quality tequila for depth.  Don't overpower the tomato juice with citrus; use just enough lime and orange to brighten.  A touch of sugar syrup balances the acidity, but don't make it sweet.  Use a good pinch of salt to enhance the savory notes and rim your glass with a salted edge for a sophisticated touch. "
    },
    "privateer": {
        "description": "For a perfectly balanced Privateer, use a high-quality tequila that complements the tropical fruit notes. Ensure the passionfruit syrup is homemade or a good quality store-bought option.  Shake well with ice to chill and dilute the cocktail.  Use fresh lime juice for optimal tartness.  A pinch of salt enhances the sweetness and brings out the flavor of the tequila. Garnish with a lime wheel or a passionfruit wedge. "
    },
    "hot_toddy": {
        "description": "For the perfect Hot Toddy, start with a good quality whiskey. Use real honey, not artificial sweeteners.  Don't overcook the cinnamon and cloves, just a simmer is enough to infuse the flavor.  Use freshly squeezed lemon juice for brightness.  A splash of hot water can help dissolve the honey and create a smooth texture.  Lastly, garnish with a lemon wedge and cinnamon stick for that classic touch. "
    },
    "dry_rob_roy": {
        "description": "For a perfect Dry Rob Roy, chill your glass and ingredients beforehand. Use a good quality Scotch and a dry vermouth with low sugar content.  Gently stir the cocktail with ice, ensuring the vermouth doesn't overpower the Scotch. Express the lemon peel over the drink for a citrus aroma, then discard it.  Serve straight up in your chilled coupe glass. "
    },
    "whitecap_margarita": {
        "description": "For a perfectly frothy Whitecap Margarita, use high-quality tequila and fresh lime juice.  Shake with ice until super cold, then strain into a salt-rimmed glass. For a smooth, creamy texture, use a high-quality cream of coconut.  Don't over-shake, or it will become too foamy. Garnish with a lime wedge and enjoy the sweet, tropical, and slightly tart flavor. "
    },
    "monkey_gland": {
        "description": "For a killer Monkey Gland, use a high-quality gin with botanicals that complement the orange and grenadine. Chill your ingredients, especially the orange juice, for a refreshing drink.  Shake vigorously with ice to ensure proper dilution and a smooth texture. Don't overdo the grenadine; a touch of red is all you need for color and sweetness. Finish with a playful orange twist garnish. "
    },
    "kiwi_lemon": {
        "description": "For a refreshing Kiwi Lemon, use a good quality Kiwi Liqueur for optimal flavor.  Start with a chilled glass to maintain the drink's coolness.  Muddle a few fresh kiwi slices with the ice for extra fruitiness, but be careful not to over-muddle.  Use a good quality Bitter Lemon for a clean, crisp finish. "
    },
    "vodka_russian": {
        "description": "This is a very straightforward drink, but a few things can elevate it.  Always use chilled vodka and Schweppes Russian for optimal refreshment. A proper Collins glass is key for the right dilution and presentation.  A twist of lemon or lime adds a nice citrus note.  Finally, don't forget to garnish with a lemon or lime wedge.  This cocktail is simple, but the details matter. "
    },
    "nutty_irishman": {
        "description": "Chill your glass and ingredients beforehand for a super smooth, refreshing drink. Use high-quality Irish Cream and Frangelico for the best flavor. Shake vigorously with ice to ensure proper emulsification and a creamy texture.  Don't over-shake, as you want the drink to be thick, not watery. Garnish with a chocolate shavings or a sprinkle of cinnamon for an extra touch of indulgence. "
    },
    "orange_rosemary_collins": {
        "description": "Muddle rosemary with a splash of gin to release its aroma.  Freshly squeeze your juices for vibrant flavor. Use simple syrup instead of rosemary syrup for a more subtle flavor.  Gently stir and top with soda water to maintain the beautiful layers. Garnish with a rosemary sprig and orange peel, expressing the oils over the drink before placing it. "
    },
    "brigadier": {
        "description": "Ensure the hot chocolate is rich and velvety, not watery.  Use a good quality dark chocolate for the best flavor.  Don't overdo the Chartreuse, just a dash for complexity.  Heering adds a cherry sweetness, so adjust accordingly based on the chocolate's sweetness.  Stir gently to avoid diluting the hot chocolate, and serve immediately.  Enjoy! "
    },
    "egg_cream": {
        "description": "While not technically a cream, the Egg Cream relies on the right technique.  Use a tall glass filled with ice to chill the milk before adding it to the chocolate syrup.  Pour the soda water last, creating a beautiful, cascading fizz.  The trick is to layer the ingredients for maximum visual and flavor impact. Don't over-shake or stir, as this will create foam and dilute the flavor. "
    },
    "rum_cooler": {
        "description": "Use a high-quality rum for best flavor. Muddle the lemon wedge with a bit of sugar for a sweeter, more aromatic drink. For a more intense flavor, use fresh lime juice instead of lemon-lime soda. If you want a stronger drink, increase the rum ratio. Don't over-shake, just enough to chill and combine the ingredients.  Serve it in a tall glass with ice and garnish with a lemon wedge. "
    },
    "radioactive_long_island_iced_tea": {
        "description": "This cocktail is a monster!  Start with a strong base of your preferred liquor (rum, vodka, tequila, gin) and add the others in order of strength. Measure carefully!  The Triple Sec adds a citrusy note, Chambord and Midori are the sweet elements, and Malibu adds a hint of coconut.  Always use high-quality ingredients for the best flavor. This drink is best enjoyed with a friend (and a designated driver!). "
    },
    "aviation": {
        "description": "To ensure a balanced and aromatic Aviation, use high-quality gin with juniper forward notes. Freshly squeezed lemon juice is crucial, so avoid bottled. Maraschino liqueur should be high-quality, not overly sweet. Shake well with ice to chill and dilute, then strain into a chilled coupe glass. Garnish with a lemon twist, expressing oils over the drink before dropping it in.  "
    },
    "mojito": {
        "description": "For a perfect Mojito, muddle the mint gently, don't pulverize it. Use a light touch with the sugar, just enough to dissolve. Add the rum after the soda, as it will sink to the bottom. For a refreshing twist, add a lime wheel to the glass before muddling. Don't forget the ice! "
    },
    "harvey_wallbanger": {
        "description": "For a perfect Harvey Wallbanger, chill your glass and vodka beforehand.  Pour the vodka first, then Galliano, allowing it to float on top.  Gently add orange juice last, aiming for a layered look.  Don't stir – you want to maintain the distinct flavors.  A light squeeze of orange for garnish completes the experience. "
    },
    "bluebird": {
        "description": "This cocktail is a classic for a reason.  The key is to balance the sweetness from the Triple Sec and Blue Curacao with the dry gin and a dash of bitters. Don't over-muddle the cherry; a gentle press releases flavor without making the drink cloudy.  A long, thin peel of lemon adds a citrusy aroma without overwhelming the taste.  Enjoy! "
    },
    "cuba_libra": {
        "description": "For a perfect Cuba Libre, start with high-quality dark rum. Muddle the lime wedge directly in the glass for maximum freshness, not just juice. Use good quality cola, the sweetness balances the rum perfectly. Fill with ice and top with cola, gently stirring to avoid diluting the rum. Garnish with a lime wheel and enjoy! "
    },
    "easy_speak": {
        "description": "This cocktail is all about balance. Use a high-quality bourbon for depth. Don't skimp on the Cynar, its artichoke notes are essential.  A good quality chocolate bitters will add complexity.  The gum syrup is key for sweetness, but don't overdo it.  A dash or two is plenty.  Chill everything beforehand for a crisp, refreshing drink.  Stir well and enjoy! "
    },
    "spice_75": {
        "description": "Muddle the sugar and allspice with a splash of rum to extract the most flavor.  Don't over-muddle, just until the sugar dissolves and the spices release their aroma.  Use fresh lime juice for a brighter taste.  Top with chilled champagne and garnish with a vibrant orange spiral for visual appeal.  This creates a balanced cocktail with a spicy kick. "
    },
    "san_francisco": {
        "description": "Chill your glass and ingredients beforehand for a refreshing experience.  Use a quality vodka and a good creme de banane for a richer flavor.  Shake vigorously with ice to ensure thorough blending.  Float the grenadine over the top to create a layered visual effect, but be mindful of the ratio to avoid an overly sweet taste. Garnish with an orange twist for a classic touch. "
    },
    "lone_tree_cocktail": {
        "description": "Use a good quality gin and a vermouth that's not overly sweet.  Chill your glass beforehand and stir the drink with ice to ensure a perfectly chilled cocktail. Don't over-stir or the gin will become cloudy. Garnish with a lemon twist for a citrusy aroma and a final touch of elegance. "
    },
    "radler": {
        "description": "The Radler is a simple, refreshing drink, but here's a pro tip: **Start with chilled ingredients**. This ensures the perfect balance of temperature and flavor. Use a good quality beer, ideally a wheat beer or Hefeweizen. Don't over-pour the 7-Up – a little goes a long way.  Gently stir to combine, not shake, to avoid creating too much foam. "
    },
    "applecar": {
        "description": "For a crisp Applecar, chill your ingredients beforehand. Use fresh lemon juice for optimal flavor. Shake vigorously with ice to ensure proper dilution and a refreshing chill. Strain into a chilled coupe glass, and garnish with a lemon twist for an elegant touch. "
    },
    "margarita": {
        "description": "For a perfect Margarita, **fresh is key**. Use freshly squeezed lime juice, not bottled.  **Chill your ingredients:** tequila, Grand Marnier, and lime juice, for a crisp, refreshing taste.  **Rim the glass with coarse salt** for a classic touch.  **Shake well with ice** to dilute slightly and chill thoroughly.  **Don't over-shake** or you'll get a cloudy drink.  Lastly, **adjust sweetness** to your preference with agave syrup. "
    },
    "the_jimmy_conway": {
        "description": "Start with a chilled glass, as it will help keep your cocktail cool.  Use a good quality Irish whiskey, and a sweet Amaretto.  Shake the cocktail with ice, and strain into the glass. A splash of fresh cranberry juice adds a subtle sweetness and tartness to the final drink.  Garnish with a lime wedge. "
    },
    "bahama_mama": {
        "description": "Use a good quality dark rum for depth. A splash of banana liqueur adds tropical sweetness, but don't overdo it. Grenadine gives a vibrant red hue and tartness. Balance the sweetness with plenty of pineapple and orange juice.  Shake well with ice to chill thoroughly and use a large glass to show off the vibrant colors. Garnish with a pineapple wedge and cherry for that classic Bahama Mama touch. "
    },
    "tomato_tang": {
        "description": "For a crisp Tomato Tang, use fresh, chilled tomato juice and a good quality celery salt.  The ratio of tomato to lemon juice is key: start with a 4:1 ratio and adjust to taste.  Shake vigorously with ice to chill and dilute the drink.  Rim the glass with celery salt for a savory touch.  Garnish with a celery stalk or a sprig of fresh basil. "
    },
    "texas_rattlesnake": {
        "description": "When building your Texas Rattlesnake, remember this:* **Layer Carefully:** The key is to slowly pour the liquids, ensuring each layer remains distinct. Start with the heaviest (Yukon Jack), then Cherry Brandy, Southern Comfort, and finally Sweet and Sour. * **Chill Everything:** Pre-chill the glasses for a refreshingly cold experience.  * **Use Good Quality:**  Use top-shelf Southern Comfort for the best flavor.* **Garnish:** A cherry or orange peel adds a touch of elegance. "
    },
    "hemingway_special": {
        "description": "For a perfect Hemingway Special, use a good quality white rum. Freshly squeezed grapefruit juice is key. Don't be afraid to use a generous amount of maraschino liqueur, it balances the bitterness of the grapefruit.  Shake vigorously with ice to chill and dilute.  Strain into a chilled coupe glass and garnish with a grapefruit twist or a maraschino cherry. "
    },
    "snowball": {
        "description": "Chill your glass beforehand for a frosty presentation. Use good quality Advocaat, as it's the star of the show. Freshly squeezed lemon juice is key for a bright flavor. Shake vigorously with ice to ensure proper dilution and a smooth texture. Garnish with a lemon twist for an aromatic touch. "
    },
    "mudslinger": {
        "description": "The Mud Slinger is a simple yet tasty cocktail that's easy to make.  The key is balance -  don't overdo the Southern Comfort, as it can easily overpower the drink.  Use fresh-squeezed orange juice whenever possible, and chill the cola for a refreshing experience.  A good muddler can help with the orange slices, but a bar spoon will do in a pinch.  Don't forget the ice!  "
    },
    "lemouroudji": {
        "description": "For the Lemouroudji, fresh is best! Use a muddler to crush the ginger and lemon zest for maximum flavor.  Don't overdo the cayenne - a pinch is enough to provide a subtle kick.  You can adjust the sugar to your preference, but start with a small amount and taste as you go. Finally, shake vigorously with ice to ensure a perfectly chilled and well-balanced drink. "
    },
    "irish_coffee": {
        "description": "Use freshly brewed coffee, preferably hot but not boiling.  Dissolve the sugar in the coffee before adding whiskey, as the sugar will melt better in hot coffee.  Pour whiskey over a back of a bar spoon to avoid disturbing the coffee.  Top with freshly whipped cream and a sprinkle of cinnamon or nutmeg for a classic touch.  Don't overfill the glass!  Enjoy! "
    },
    "texas_sling": {
        "description": "This drink is potent!  Use a chilled mixing glass to keep it cool.  Start with a small pour of 151, as a little goes a long way.  Don't over-shake - you want a smooth texture, not a milkshake.  Garnish with a sprinkle of cocoa powder or a cherry, but keep it simple to let the flavors shine. "
    },
    "negroni": {
        "description": "**Negroni Tips:*** **Use quality ingredients:** A good Negroni starts with good gin, Campari, and sweet vermouth.* **Equal parts:** The classic Negroni uses equal parts of each ingredient.* **Stir, don't shake:** Shaking will dilute the drink.* **Chill the glass:** A chilled glass will keep the drink cold.* **Garnish with an orange peel:** The orange peel adds a citrusy aroma and flavor."
    },
    "24k_nightmare": {
        "description": "This drink is potent!  Start with a chilled rocks glass.  Pour Goldschlager first, then Jägermeister, followed by Rumple Minze.  Top with the 151 Rum, but go slow!  A little goes a long way.  Garnish with a lime wedge for a touch of brightness, and be sure to have a straw for a smoother sip.  Enjoy responsibly! "
    },
    "69_special": {
        "description": "For a crisp, balanced 69 Special, start with a good quality gin. Use fresh lemon juice, not bottled, and ensure it's well-chilled.  A light hand with the 7-Up is key - you want it to complement, not overpower.  Shake with ice, strain into a chilled coupe glass, and garnish with a lemon twist for an elegant touch. "
    },
    "poppy_cocktail": {
        "description": "For a velvety smooth Poppy Cocktail, chill your gin and crème de cacao separately before mixing. This ensures a perfectly chilled drink. Use a good quality crème de cacao for a richer flavor profile.  Don't over-shake the cocktail, as this can dilute it. Garnish with a Luxardo cherry or a twist of orange peel for an elegant touch.  "
    },
    "scooter": {
        "description": "The Scooter is a creamy, sweet drink that can be easily over-sweetened. To balance the flavors, use a high-quality brandy with a good fruitiness and a well-aged Amaretto.  Don't be afraid to adjust the cream to your liking, but a little goes a long way.  Shake the cocktail vigorously with ice to ensure the ingredients are properly combined and chilled. "
    },
    "lemon_shot": {
        "description": "To make the Lemon Shot smooth and balanced, use fresh lemon juice and a good quality sugar syrup.  Don't be afraid to adjust the ratios to your taste, but start with a 1:1:1:1 ratio of Galliano, Citron, lemon juice, and sugar syrup.  A tiny dash of 151 proof rum adds a fiery kick, but use it sparingly for maximum effect.  Shake well with ice and strain into a shot glass. "
    },
    "dirty_martini": {
        "description": "For a perfect Dirty Martini, use high-quality vodka and dry vermouth.  The key is the olive brine – a little goes a long way. Start with a dash and adjust to taste, ensuring it's just dirty enough.  Garnish with a lemon twist and a plump olive – the colder the better.  Chill everything beforehand for a crisp, satisfying drink. "
    },
    "b_52": {
        "description": "The key is layering, so use a shot glass or a small cocktail glass. Pour Kahlua first, then Grand Marnier carefully down the back of a spoon, and finally Baileys on top. The layers should be distinct. Don't stir, just light the Baileys on fire with a long match or lighter, let it burn for a few seconds, then extinguish it before drinking.  Enjoy! "
    },
    "new_york_lemonade": {
        "description": "To make a truly refreshing New York Lemonade, start by chilling all your ingredients. Use fresh lemon juice for the best flavor.  Shake vigorously with ice to ensure a frosty, well-combined drink. Don't over-pour the Grand Marnier - you want a subtle orange flavor, not a cloying sweetness.  Top with club soda for a bubbly finish. "
    },
    "ice_pick": {
        "description": "This one's all about balance. Use a good quality vodka and fresh lemon juice for the best flavor.  Don't overpower the tea with too much lemon. Start with a 1:1 ratio of iced tea to vodka, then add lemon juice to taste.  Shake with ice for a frosty, refreshing drink. If you're feeling fancy, rim the glass with sugar before pouring. "
    },
    "mango_mojito": {
        "description": "Muddle the mint and mango aggressively to release their flavors. Don't over-muddle, you want a smooth purée, not a paste. Use a quality white rum and fresh lime juice. Don't skimp on the ice, it dilutes the cocktail and keeps it cool. Adjust the sweetness to your liking with additional mango purée or simple syrup. Top with soda water for a refreshing fizz. "
    },
    "long_island_tea": {
        "description": "This drink packs a punch, so use a light hand with the booze.  Don't skimp on the lemon juice, it helps balance the sweetness.  Shake it hard with ice to chill it properly.  Use good quality spirits for best results.  And lastly, remember, this is not a tea! "
    },
    "fruit_cooler": {
        "description": "Muddle the strawberries and sugar with a touch of lemon juice to release their sweetness and aroma.  Use a good quality apple juice for depth of flavor.  Don't over-muddle the apple; just a few light presses to release its fragrance.  Top with soda water for a refreshing fizz and serve with ice for a cool, crisp drink.  Garnish with a lemon wedge and a strawberry for visual appeal. "
    },
    "gin_sour": {
        "description": "For a perfect Gin Sour,  use a good quality gin and fresh lemon juice.  Shake vigorously with ice to chill and emulsify.  Use a bar spoon to gently stir the cocktail before serving.  For a visually appealing presentation, garnish with a lemon twist and a maraschino cherry, resting on the edge of the glass.  "
    },
    "stinger": {
        "description": "A Stinger is all about balance.  Use high-quality brandy for a sophisticated flavor. The white creme de menthe is key – start with a small amount and adjust to taste, as it can quickly overpower.  Chill both ingredients beforehand for a refreshing drink. Shake with ice vigorously to ensure a smooth, velvety texture.  Garnish with a mint sprig for visual appeal. "
    },
    "karsk": {
        "description": "When making Karsk, use freshly brewed coffee, strong and hot.  The grain alcohol should be high-proof, like vodka or aquavit, to retain the coffee flavor. Start with a small amount of alcohol and add more to taste. Avoid over-mixing, as it can dilute the coffee. Serve immediately in heat-resistant mugs for a warming experience. "
    },
    "espresso_rumtini": {
        "description": "Use a high-quality rum for the best flavor.  Ensure the espresso is fresh and strong, and don't be afraid to add a touch more vanilla syrup if you prefer a sweeter drink.  Shake vigorously with ice to chill and dilute the drink.  Garnish with a coffee bean or a sprinkle of cocoa powder for an extra touch of flavor and elegance. "
    },
    "long_vodka": {
        "description": "This is a simple yet refreshing drink.  Chill your glass beforehand, the lime juice should be freshly squeezed, and use good quality tonic water.  A dash of Angostura is key, so don't be shy! Gently stir the vodka, lime, and bitters before topping with tonic water.  Garnish with a lime wedge.  Enjoy! "
    },
    "iced_coffee_fillip": {
        "description": "Use freshly brewed, strong coffee for best flavor.  Chill it thoroughly before mixing, it'll keep your drink refreshingly cold.  A splash of simple syrup helps balance the bitterness of coffee and Kahlua. Don't be afraid to adjust the ratios to your taste!  And always serve it over ice for a cool, refreshing drink. "
    },
    "limeade": {
        "description": "For a perfect Limeade, use fresh limes and muddle them gently to release oils for aroma.  Use a good quality sugar for sweetness and adjust to your taste.  Chill your soda water beforehand for a refreshing drink.  A simple garnish of a lime wheel or a twist of lime peel adds a beautiful touch. "
    },
    "almeria": {
        "description": "The Almeria is a delightful twist on a classic. To ensure a smooth, frothy texture, **dry shake the egg white and rum first**. This creates a stable foam. **Then, add the Kahlua and shake with ice** for a well-chilled cocktail. **Strain into a chilled coupe glass** and garnish with a coffee bean or a sprinkle of cocoa powder. "
    },
    "acapulco": {
        "description": "This drink benefits from a good dry shake.  Shake the ingredients without ice for 15 seconds to emulsify the egg white and create a frothy texture.  Then add ice and shake again vigorously.  Double strain to remove ice shards and egg white bits.  Garnish with a sprig of fresh mint for a vibrant aroma and visual appeal. "
    },
    "the_philosopher": {
        "description": "Chill your glass and ingredients beforehand. Use a good quality gin and a melon liqueur with a distinct flavor. Don't overdo the orange bitters - a dash is all you need.  Shake vigorously with ice, then strain into the chilled glass. Top with Prosecco, adding it gently to retain the bubbles. Garnish with a lemon twist for a fragrant touch. "
    },
    "zipperhead": {
        "description": "This cocktail is light and refreshing, but beware of the Zipperhead name. It's considered offensive and outdated.  When making it, chill your glass and use a high-quality vodka for a clean taste. Build it with Chambord at the bottom, then vodka, and top with soda water for a layered effect.  Gently stir to combine without over-mixing. Garnish with a raspberry for a beautiful and flavorful touch. "
    },
    "port_and_starboard": {
        "description": "The Port and Starboard is a layered beauty, so technique is key. Start by chilling your glass.  Pour grenadine slowly down the side to create the bottom layer.  Carefully float the crème de menthe on top using a spoon, allowing it to gently pour over the back of the spoon.  Don't stir!  A cherry or mint sprig adds a nice touch. "
    },
    "tres_pasion": {
        "description": "For a vibrant Tres Pasion, use fresh lime juice and a high-quality tequila. Shake the passionfruit syrup, tequila, Aperol, and lime juice with ice vigorously to chill and emulsify. Strain into a chilled glass over ice, then top with your chosen soda for a refreshing fizz. Adjust sweetness with a splash of simple syrup if needed.  "
    },
    "fig_manhattan": {
        "description": "Use a good quality fig syrup, not overly sweet. A dash of Angostura bitters is key.  Chill the glass beforehand for a crisp drink.  Stir, don't shake, to maintain the clarity and texture of the fig syrup.  A single cherry garnish adds elegance. "
    },
    "holloween_punch": {
        "description": "For a vibrant Halloween Punch, chill your grape juice and soft drink thoroughly. Use a sherbet that complements the grape flavor, like orange or lemon. Layer the punch in a punch bowl with the sherbet on the bottom for a dramatic effect. Stir gently to combine just before serving to maintain the layers and prevent the sherbet from dissolving too quickly.  Don't forget the spooky garnishes! "
    },
    "jacks_vanilla_coke": {
        "description": "To elevate your Jack's Vanilla Coke, use a good quality Tennessee Whiskey. For a smoother vanilla note, use a high-quality extract.  Chill the Coca-Cola beforehand for a crisp, refreshing drink.  A dash of Angostura bitters adds complexity.  Don't over-shake, you want a gentle mix, not a foamy mess.  Serve over ice, garnished with a cherry or orange peel for that classic touch. "
    },
    "corpse_reviver": {
        "description": "When making a Corpse Reviver #2, use a good quality gin for a balanced flavor.  For the absinthe, a small splash is key;  too much will overpower the drink.  Shake well with ice to ensure thorough chilling and dilution.  Garnish with a lemon twist for a classic touch. "
    },
    "duchamps_punch": {
        "description": "Chill your Pisco and St. Germain for a crisp, refreshing punch. Muddle the pepper and lavender gently to release aromas without bitterness. Use fresh lime juice for the best flavor. Shake vigorously with ice to thoroughly chill and dilute the cocktail. Garnish with a lime wedge and a sprig of lavender for a beautiful and aromatic touch. "
    },
    "vesuvio": {
        "description": "For a frothy Vesuvio, use a high-quality light rum and a good sweet vermouth. Freshly squeezed lemon juice is key.  Dry shake the egg white and other ingredients first to build foam.  Then add ice and shake again vigorously. Strain into a chilled coupe. Garnish with a lemon twist for a classic touch. "
    },
    "imperial_cocktail": {
        "description": "The Imperial Cocktail is a delightful balance of tart, bitter, and boozy. To ensure a perfect pour: * Use freshly squeezed lime juice for optimal flavor.* Chill your gin and Aperol beforehand to maintain a cool, refreshing drink. * Shake vigorously with ice to thoroughly chill and blend the ingredients.* Strain into a chilled coupe glass for a sophisticated presentation. "
    },
    "9_1_2_weeks": {
        "description": "When crafting the 9 1/2 Weeks, prioritize fresh, quality ingredients. Chill your Absolut Citron and orange juice beforehand for a crisp, refreshing drink. Shake vigorously with ice to ensure proper dilution and a smooth texture. A delicate balance is key: use a light hand with the strawberry liqueur for a subtle sweetness, and adjust the curacao to your liking. Garnish with a strawberry slice or orange twist for a vibrant touch. "
    },
    "gin_daisy": {
        "description": "For a perfectly balanced Gin Daisy, use a high-quality gin and freshly squeezed lemon juice.  Shake the cocktail hard with ice to ensure a frosty, well-chilled drink. A dash of grenadine adds a subtle sweetness and beautiful color gradient.  Finally, don't forget the maraschino cherry for a classic touch, but feel free to garnish with a fresh orange peel for added zest. "
    },
    "zorro": {
        "description": "For a smooth Zorro, layer the ingredients carefully. Start with a splash of Sambuca at the bottom, followed by Baileys for a creamy middle, and finish with White Creme de Menthe, creating a distinct green top layer.  Chill your glasses beforehand and use a bar spoon to gently pour the layers. This will ensure the flavors don't mix too quickly, allowing for a visually appealing and tasty experience. "
    },
    "elderflower_caipirinha": {
        "description": "Muddle the lime aggressively to release the oils, don't be shy!  A good muddle is key to a balanced Caipirinha.  Use a high-quality cachaça for best results.  A little bit of elderflower cordial goes a long way, so start with a small amount and adjust to your liking.  Serve it chilled and garnish with a lime wedge.  Cheers! "
    },
    "melya": {
        "description": "To make a Melya truly sing, use freshly brewed espresso for a bolder flavor.  Don't be shy with the cocoa powder, as it adds depth and complexity.  Use a good quality honey, and adjust sweetness to taste.  Shake well with ice to ensure a smooth, chilled texture.  A sprinkle of cocoa powder on top adds a final touch of elegance. "
    },
    "pure_passion": {
        "description": "For a Pure Passion that explodes with flavor, use fresh lime juice and high-quality rum.  Muddle mint gently to release its aroma, but avoid bruising it.  Add passion fruit syrup to taste, starting with a small amount and adjusting to your preference. A few dashes of peach bitters add complexity, but don't overdo it!  Shake hard with ice to chill and combine flavors, then strain into a chilled glass.  Garnish with a mint sprig and a lime wheel for a beautiful finish."
    },
    "martinez_2": {
        "description": "A Martinez 2 is a classic with subtle nuances. Use a high-quality gin for a bright base.  Chill your ingredients, especially the vermouth, to preserve its aromatic profile.  A dash of Angostura bitters enhances the complexity.  When stirring, use a gentle hand to avoid over-dilution.  Garnish with a Luxardo cherry, allowing its sweetness to complement the drink.  "
    },
    "mimosa": {
        "description": "For a perfect Mimosa, use chilled champagne and fresh-squeezed orange juice.  A 1:1 ratio is classic, but adjust to your taste.  Gently pour the juice into the champagne to avoid excessive foaming.  Don't overfill the glass, leaving room for a garnish of orange peel or a fresh raspberry. "
    },
    "white_russian": {
        "description": "For the perfect White Russian, chill your glassware and vodka. Use a good quality coffee liqueur, preferably one with a strong coffee flavor. Pour the vodka and liqueur first, then gently layer the cream on top to create a beautiful gradient. Avoid stirring, as this will create a milky mess. Garnish with a coffee bean or a sprinkle of cocoa powder. "
    },
    "afterglow": {
        "description": "The Afterglow is a simple yet delicious cocktail. To make it shine, use freshly squeezed orange and pineapple juice for the best flavor.  A splash of grenadine adds a beautiful red hue and a touch of sweetness, but go easy - you want the citrus to dominate.  Shake well with ice and serve in a chilled glass. A cherry or orange wedge makes a lovely garnish. "
    },
    "popped_cherry": {
        "description": "For a perfectly balanced Popped Cherry, use high-quality vodka and a cherry liqueur with strong cherry flavor.  Freshly squeezed orange juice is key, so use it sparingly.  Shake well with ice to ensure a smooth, chilled consistency.  Don't over-dilute with cranberry juice – a little goes a long way.  Finish with a maraschino cherry for a festive touch. "
    },
    "clove_cocktail": {
        "description": "To elevate your Clove Cocktail, remember these tips: * **Chill all ingredients** - This ensures a refreshing, well-balanced drink. * **Use quality vermouth** - A good vermouth adds complexity and depth. * **Muddle fresh cloves** -  This brings out the spice and aroma of the clove. * **Stir gently** - Avoid over-mixing to preserve the delicate flavors. * **Garnish with a lemon twist** - The citrus brightens the cocktail and adds a touch of elegance. "
    },
    "vodka_tonic": {
        "description": "Start with a chilled highball glass. Use a good quality vodka, and don't over-pour. A light hand with the tonic is key - you want it to be bubbly, not watery. A gentle squeeze of lemon peel releases oils, giving the drink a bright citrus aroma.  No need to muddle - a simple garnish of a lemon twist adds elegance. "
    },
    "dirty_nipple": {
        "description": ""
    },
    "stolen_negroni": {
        "description": "When crafting the Stolen Negroni, prioritize ice. Use large cubes or a sphere for slow melting and dilution. Ensure equal parts of Gin, Cynar, and Aperol for a balanced bitter-sweet profile. Stir gently to chill and blend flavors, avoiding over-dilution. Garnish with an orange peel, expressing its oils over the drink. "
    },
    "quakers_cocktail": {
        "description": "**Bartender Tips:*** Use a high-quality light rum for a clean, smooth flavor.* Opt for a fruity brandy like Armagnac or Cognac to complement the raspberry syrup.* Freshly squeeze the lemon juice for optimal brightness.* Adjust the raspberry syrup to your desired sweetness level.* Shake well with ice to chill the cocktail and dilute it properly.* Garnish with a lemon twist or a fresh raspberry for an elegant touch. "
    },
    "grapefruit_gin_sour": {
        "description": "For a balanced Grapefruit Gin Sour, use a high-quality gin and a grapefruit cordial that's not too sweet.  Shake the cocktail vigorously with ice to chill it thoroughly.  A splash of club soda adds a refreshing effervescence.  To garnish, use a grapefruit wedge or a sprig of rosemary. "
    },
    "oaxacan_old_fashioned": {
        "description": "For a balanced Oaxacan Old Fashioned, use a good quality, smoky Mezcal and a high-proof Tequila.  Dissolve the Demerara Gum Syrup in a little hot water to create a smooth syrup.  Don't over-muddle the orange peel, just a light squeeze to release oils.  Use a large ice cube for slow dilution and a rocks glass to retain the smoky aroma.  Finish with a dash of chocolate bitters and a flamed orange peel for a dramatic touch. "
    },
    "rum_sour": {
        "description": "Use a good quality light rum for a brighter flavor.  Freshly squeeze your lemon juice for the best tartness.  A simple syrup is easier to work with than granulated sugar.  Muddle a thin orange peel with the sugar, creating a flavorful base.  Shake well with ice, and strain into a chilled coupe glass.  Garnish with a cherry and a lemon twist. "
    },
    "aramadillo’s_light": {
        "description": "Ensure your orgeat syrup is fresh and fragrant.  Use high-quality wheated bourbon for a smooth finish.  Shake vigorously with ice to chill and dilute properly.  Strain into a chilled coupe glass and garnish with a lemon twist for a vibrant touch.  Don't be afraid to adjust the sweetness with additional grenadine or orgeat to your liking. "
    },
    "americano": {
        "description": "Chill your glass and ingredients beforehand.  Use good quality Campari and Vermouth, and be precise with measurements.  Express the peels over the drink before discarding them, and ensure your ice is fresh.  Stir gently to combine, avoiding dilution.  A simple garnish of a lemon twist adds a touch of elegance.  Enjoy! "
    },
    "mauresque": {
        "description": "For the Mauresque, **precision matters**.  Start with chilled Ricard, and use a good quality orgeat syrup.  Measure carefully, as the balance is delicate.  Don't over-dilute with water – a splash is all you need to brighten the flavors.  Stir gently to ensure a smooth blend.  Serve in a chilled coupe or martini glass for maximum enjoyment. "
    },
    "at&t": {
        "description": "The AT&T is a simple yet refreshing cocktail, but getting the balance right is key. Use a high-quality gin for a better flavor profile. Start with a 1:1 ratio of vodka and gin, and adjust to your liking.  Chill the tonic water before serving to keep it bubbly. Don't over-mix the cocktail, as it can make the gin taste overly bitter.  A simple garnish of lime or lemon wedge enhances the taste. "
    },
    "halekulani": {
        "description": "This cocktail is a tropical delight! For a balanced Halekulani, shake well with ice to ensure proper dilution. Don't skimp on the fresh juices; they bring the vibrant flavors. Start with a small amount of grenadine for sweetness, adjust to taste. A touch of Angostura bitters adds complexity. Finally, garnish with a pineapple wedge and a maraschino cherry for a delightful presentation. "
    },
    "double_fill_up": {
        "description": "The Double Fill Up sounds intriguing! To make it a hit, use fresh lemon juice for a brighter flavor. Start with a 2:1 ratio of rye to grenadine, adjusting to taste. Shake hard with ice for a well-chilled, frothy drink.  Strain into a chilled coupe glass and garnish with a lemon twist. You can even rim the glass with sugar for a classic touch. "
    },
    "avalanche": {
        "description": "The Avalanche is a simple, but delicious cocktail. Here are a few tips: * **Chill your glass:** A frosty glass enhances the flavor and keeps the drink colder longer. * **Use good quality cream:** Avoid using ultra-pasteurized cream, as it will separate.* **Shake with ice:** This ensures the drink is well-chilled and the ingredients are properly blended.* **Garnish with a sprinkle of cocoa powder or a cherry.**  "
    },
    "zenmeister": {
        "description": "Chill your Jägermeister and root beer thoroughly. Use a highball glass filled with ice. Pour 1.5 oz Jägermeister and top with chilled root beer. Stir gently to blend. Garnish with a lime wedge or orange peel for a refreshing twist. "
    },
    "empellón_cocinas_fat_washed_mezcal": {
        "description": "Use a good quality mezcal with smoky notes to complement the chocolate and coffee flavors. Don't over-shake the cocktail as you want to preserve the mezcal's smoky aroma.  Use a high-quality chocolate liqueur like crème de cacao for a rich, decadent flavor. Consider using a coffee liqueur with a complex flavor profile to add depth to the cocktail. Garnish with a chocolate shavings or a coffee bean to enhance the aromatic experience. "
    },
    "ruby_tuesday": {
        "description": "Use a high-quality gin for a brighter, more complex flavor.  Chill all ingredients beforehand for a refreshing drink.  Shake with ice vigorously to ensure thorough mixing.  Don't over-pour grenadine; a small amount adds color and sweetness without overpowering the cranberry.  Garnish with a lime wedge or a sprig of rosemary for a festive touch. "
    },
    "tuxedo_cocktail": {
        "description": "When making a Tuxedo Cocktail, ensure your gin is bone dry and your vermouth is well-chilled. A dash of orange bitters brings a bright, citrusy note, while a single drop of anis adds an intriguing layer of complexity. Don't overdo the maraschino liqueur, as it can easily overpower the delicate flavors. Chill your coupe glass thoroughly for a beautifully chilled experience.  "
    },
    "downshift": {
        "description": "This sounds like a fun, but potentially strong, concoction. When mixing, start with a good base of Fruit Punch and Sprite, then add Tequila to taste - a little goes a long way. Finally, add just a splash of 151 Rum for that extra kick. Remember, you can always add more, but you can't take it back out.  Use a shaker with ice for a truly chilled and refreshing drink. "
    },
    "turkeyball": {
        "description": "For a balanced Turkeyball, use a good quality Wild Turkey bourbon.  Don't be afraid to shake it hard with ice - this chills the drink and helps integrate the flavors.  The pineapple juice should be fresh, not overly sweet.  If you're looking for a more robust flavor, experiment with adding a dash of bitters. Finally, garnish with a pineapple wedge or cherry for a festive touch. "
    },
    "million_dollar_gin": {
        "description": "For a Million Dollar Gin, chilling your ingredients beforehand is key. Use high-quality gin and vermouth for a smoother, more complex taste. Shake vigorously with ice to ensure proper dilution and a frosty finish. Don't over-pour the grenadine; a splash is all you need for a beautiful color gradient. Garnish with a pineapple wedge and a maraschino cherry for a classic touch. "
    },
    "lassi_sweet": {
        "description": "For a smooth and refreshing Lassi, use good quality, thick yogurt. Blend it with water, sugar, and salt until perfectly smooth, then add lemon juice at the end for a bright zing.  Don't overblend, or you'll end up with a thin, watery lassi. Adjust sweetness and salt to taste. "
    },
    "gin_lemon": {
        "description": "For a crisp Gin Lemon, use a good quality gin and fresh lemon juice. Muddle the lemon peel to release oils before adding ice and gin.  Shake vigorously to chill and dilute, and strain into a chilled coupe. Garnish with a lemon twist for extra citrus aroma. Don't over-muddle the peel, or it'll make the drink bitter. "
    },
    "flanders_flake_out": {
        "description": "When making Flander's Flake-Out, ensure your Sambuca is chilled, but not frozen. This will allow for easier mixing and prevent dilution. Use a high-quality Sarsaparilla for a richer, more complex flavor.  Chill the glass beforehand for an extra touch of refreshment.  Stir gently to avoid over-dilution and preserve the Sambuca's delicate aroma. Garnish with a star anise for a visual and aromatic flourish. "
    },
    "french_negroni": {
        "description": "Chill your glass and ingredients beforehand for a perfectly chilled cocktail. Use a good quality gin and Lillet Blanc for optimal flavor.  When expressing the orange peel, twist it over the drink to release the oils and add a fragrant aroma. Stir gently, not shake, to avoid dilution. "
    },
    "110_in_the_shade": {
        "description": "This sounds like a unique, refreshing twist! To nail the 110 in the Shade, chill your lager and tequila well before mixing. A good ratio is 2 parts lager to 1 part tequila.  Use a tall glass with ice and a lime wedge garnish.  Remember,  this drink is all about balance, so experiment with the ratios to find your perfect blend. "
    },
    "a_j": {
        "description": "A.J. is a refreshing, tangy cocktail, but Applejack can be a bit strong.  Use good quality grapefruit juice for the best flavor, and consider adding a splash of simple syrup for a touch of sweetness if your customer prefers.  Chill your ingredients and glassware for a crisp and invigorating experience.  A gentle shake with ice will give it a nice chill, but be sure to strain to avoid any ice shards. "
    },
    "rusty_nail": {
        "description": "For a perfect Rusty Nail, use a good quality Scotch and high-quality Drambuie.  Chill both ingredients before mixing.  Gently stir, not shake, to avoid diluting the flavors.  Express the lemon peel over the drink to release its oils, then discard it.  Serve in an old fashioned glass with a large ice cube for a slow melt and consistent chill. "
    },
    "queen_bee": {
        "description": "To make your Queen Bee sing, remember these tips: * **Chill everything**:  Cold ingredients are key for a refreshing drink.* **Use good quality ingredients**: The brandy and sherry really make a difference.* **Shake hard**: Don't be shy with the shaker!  A good hard shake will create a beautiful frothy head.* **Strain carefully**:  Avoid any bits of lime from making it into the glass.* **Garnish thoughtfully**: A lime wheel or a sprig of rosemary adds a nice touch. "
    },
    "toronto": {
        "description": "The Toronto relies on balancing sweet, spicy, and bitter notes.  Use a good quality rye for backbone, and a generous pour of Fernet for its distinctive herbal bitterness.  Aromatic bitters add complexity, so use sparingly.  Chill the ingredients beforehand for a crisp, refreshing drink.  The gum syrup provides sweetness, but don't overdo it - aim for a subtle sweetness that allows the other flavors to shine. "
    },
    "near_and_dear": {
        "description": "When crafting the Near and Dear, prioritize a dry shake (without ice) to emulsify the egg white for a velvety texture. This step should be vigorous and last for about 15 seconds.  After adding ice, shake again for a thorough chill.  Use a fine-mesh strainer to remove any ice shards and achieve a crystal clear presentation.  Finally, a touch of orange zest as garnish adds a delightful aromatic flair. "
    },
    "hot_chocolate_to_die_for": {
        "description": "Use good quality chocolate for the richest flavor.  Melt it slowly over low heat with the butter, stirring constantly.  Don't overcook the chocolate, as it can seize.  Let the mixture cool slightly before adding the half-and-half, to avoid curdling.  A splash of vanilla extract adds depth, but don't overdo it.  Top with toasted marshmallows for a delightful touch. "
    },
    "space_odyssey": {
        "description": "Use a highball glass filled with ice. Layer the ingredients carefully: 151 Rum first, then Malibu, pineapple juice, orange juice, and finally a splash of grenadine. Gently stir to combine, avoiding overmixing.  Garnish with a cherry. Remember, 151 proof rum is potent, so go easy! "
    },
    "mint_julep": {
        "description": "Use fresh mint! Muddle gently, don't pulverize it. A light touch brings out the flavor without making it bitter. Use a good quality bourbon, and don't skimp on the sugar.  A well-made Julep should be perfectly balanced, not overly sweet or minty.  Chill your glass thoroughly.  A good Julep should be refreshing and well-balanced. "
    },
    "granada_diablo": {
        "description": "To make a truly Diablo Granada, focus on balance. Use a high-quality tequila for depth, and ensure your grenadine isn't overly sweet. Shake the tequila, lime, and syrups with ice, ensuring the ginger sings through. Strain into a tall glass, top with soda, and garnish with a lime wheel. The key is to create a refreshing, slightly spicy, and tart cocktail.  "
    },
    "155_belmont": {
        "description": "For the 155 Belmont, balance is key. Use a high-quality dark rum for depth and a lighter rum for brightness.  Vodka adds a clean, neutral base.  Freshly squeezed orange juice is essential, and you can adjust the amount to your taste.  Shake well with ice to chill and dilute, and strain into a chilled glass.  Garnish with an orange peel for a touch of citrus. "
    },
    "blood_moon": {
        "description": "For a balanced Blood Moon,  start by chilling your glass. Use a high-quality bourbon and a good blood orange cordial.  Shake hard with ice to ensure proper dilution.  The aromatic bitters add complexity, but use sparingly.  A touch of cinnamon garnish adds warmth.  Adjust the lemon juice to taste for your preferred level of tartness. "
    },
    "a1": {
        "description": "This sounds like a variation on a classic, so finesse is key!  Shake hard with ice to chill thoroughly, and strain into a chilled coupe.  Don't overdo the grenadine - a few drops add a beautiful color gradient and tartness.  A citrus twist for garnish is lovely, but a maraschino cherry adds a touch of whimsy. "
    },
    "clover_club": {
        "description": "For a perfect Clover Club, remember these tips:* **Shake hard:**  Really give it a good shake to emulsify the egg white and create a silky texture.* **Dry shake:**  Before adding ice, shake without ice for 15 seconds to froth the egg white.* **Lemon twist:**  Use a fresh lemon twist, not just juice, to add a vibrant aroma and a touch of visual appeal.* **Ice:**  Use plenty of ice for a well-chilled drink.* **Grenadine:**  Don't overpower the gin with too much grenadine; use it subtly for a hint of sweetness. "
    },
    "casino_royale": {
        "description": "For a perfect Casino Royale, ensure your gin is cold.  Use fresh lemon juice, and don't over-shake the egg yolk.  A light shake will create a velvety texture, while over-shaking can make the drink frothy. A few dashes of orange bitters bring out the citrus notes.  Finally, strain the cocktail into a chilled coupe glass.  Enjoy the classic! "
    },
    "50_50": {
        "description": "Use a good quality vanilla vodka for a richer flavor. Ensure the Grand Marnier is chilled for a crisp, refreshing finish.  Shake the cocktail hard with ice to create a smooth, velvety texture. If you prefer a sweeter drink, add a splash of simple syrup. Garnish with an orange peel for an aromatic touch. "
    },
    "thriller": {
        "description": "For a Thriller with Scotch, wine, and orange juice, use a good quality Scotch for depth.  The wine should be dry and complement the Scotch, like a dry sherry or a light red.  The orange juice should be freshly squeezed for brightness.  Shake well with ice to chill and dilute, then strain into a chilled coupe glass.  Garnish with a twist of orange peel for a fragrant touch. "
    },
    "tom_collins": {
        "description": "For a perfect Tom Collins, use a good quality gin and fresh lemon juice.  Make sure to shake the gin, lemon juice, and sugar with ice to thoroughly chill the drink.  Don't over-shake, though - you want it to be well-mixed, not foamy.  Top with club soda and garnish with a maraschino cherry and an orange slice. This will ensure the drink is balanced and refreshing. "
    },
    "ramos_gin_fizz": {
        "description": "**Ramos Gin Fizz Tips:** * **Shake with Ice:** Shake vigorously with ice for at least 30 seconds to emulsify the egg white and create a thick, foamy head.* **Dry Shake:**  Do a dry shake (without ice) first to emulsify the egg white and create a silky texture. * **Fresh is Best:** Use fresh lemon juice and soda water for optimal flavor.* **Don't Over-Pour Soda:** Gently pour soda water to avoid excessive foam.* **Garnish:**  A lemon twist or sprig of mint adds a touch of elegance. "
    },
    "wine_cooler": {
        "description": "For a refreshing Wine Cooler, use a good quality dry red wine, like a Pinot Noir or Beaujolais.  Chill the wine and soda beforehand.  Fill a tall glass with ice, add the wine, top with soda, and gently stir.  Don't over-stir, as you want to keep the bubbles lively.  A lemon wedge garnish adds a nice touch. "
    },
    "broadside": {
        "description": "The Broadside is a firecracker of a cocktail, so handle the 151 proof rum with respect.  Chill your glassware for a truly icy experience.  Use a good quality Scotch, as it will be the backbone of the drink.  A dash of Angostura bitters will add a spicy kick, and absinthe will provide a subtle, herbaceous aroma.  Remember, less is more with the wormwood.  Build the drink over ice, stir gently, and garnish with a lemon twist.  Enjoy responsibly! "
    },
    "bible_belt": {
        "description": "To make a killer Bible Belt, start with fresh lime juice – bottled is a no-go. Use good quality sour mix, not the overly sweet kind.  Shake hard with ice to chill the cocktail properly.  Don't over-pour the Triple Sec, it should complement, not dominate.  A splash of soda water can give it a nice fizz. Garnish with a lime wheel, and enjoy! "
    },
    "whiskey_sour": {
        "description": "For a perfect Whiskey Sour, use fresh lemon juice - bottled juice won't cut it!  Shake hard with ice to chill and dilute the cocktail, and make sure to use good quality blended whiskey.  A dash of egg white adds a creamy texture if desired.  Don't skimp on the powdered sugar, it balances the sourness perfectly. Garnish with a cherry and a lemon twist, and enjoy! "
    },
    "sidecar": {
        "description": "For a perfect Sidecar, use fresh lemon juice, not bottled.  Shake vigorously with ice to properly chill and dilute.  Strain into a chilled coupe glass.  A sugar rim is optional, but be sure to use a fine sugar for a delicate rim.  Don't over-shake; a slightly cloudy appearance is ideal.  Garnish with a lemon twist for a refreshing aroma. "
    },
    "dont_scoff_at_the_scoff": {
        "description": "Use a good quality orgeat syrup, as it's the key ingredient. Measure the orgeat carefully for the right balance. A dash of each bitters adds complexity, but don't overdo it. Shake hard with ice to chill and dilute. Strain into a chilled coupe for a crisp, elegant presentation. "
    },
    "turf_cocktail": {
        "description": "Chill your glass and ingredients beforehand.  Use a high-quality dry vermouth, as it's the base flavor.  Don't over-shake the cocktail; a gentle stir is best to preserve the delicate aromatics.  Use fresh orange peel, and express its oils over the drink before dropping it in.  Finally, a dash of bitters adds complexity.  Enjoy! "
    },
    "frozen_pineapple_daiquiri": {
        "description": "For the best frozen pineapple daiquiri, use fresh pineapple for the sweetest flavor.  Muddle the fruit thoroughly to release its juices.  Balance the sweetness with tart lime juice, adjusting to taste.  Use a good quality light rum for a clean, bright flavor.  To ensure a smooth consistency, use a good quality blender and blend until completely smooth.  Don't forget a salted rim for an extra touch of sweetness!  Enjoy! "
    },
    "red_snapper": {
        "description": "For a perfect Red Snapper, start by chilling your glass and ingredients. Use a good quality cranberry juice for a brighter flavor. When shaking, use a firm grip to ensure proper dilution. Don't over-shake; aim for a light, frothy texture. Garnish with a lime wedge or a Luxardo cherry for a vibrant touch. "
    },
    "kentucky_mai_tai": {
        "description": "This is a unique twist on a classic! When building the Kentucky Mai Tai, focus on quality ingredients. Freshly squeezed lemon juice is essential.  Use a good quality mezcal that has a smoky character. The Cynar adds a complex, bitter note that balances the sweetness of the orgeat and peach liqueur.  Shake with ice to chill, but strain into a chilled coupe glass to prevent dilution. Enjoy the surprising complexity! "
    },
    "port_wine_cocktail": {
        "description": "For a balanced Port Wine Cocktail, use a high-quality ruby port with complex fruit notes and a smooth brandy. Chill both ingredients before mixing to ensure a refreshing drink. Measure precisely, as too much brandy will overpower the port's sweetness. Use a bar spoon to gently stir, avoiding excessive dilution.  Garnish with a cherry or orange peel for an elegant touch. "
    },
    "orange_push_up": {
        "description": "Use a high-quality spiced rum for depth of flavor.  Shake hard with ice to chill and meld the flavors.  If your sour mix is too tart, adjust with a bit more orange juice.  Don't over-shake; you want a nice balance of creamy texture and a vibrant orange hue.  For a fun presentation, rim the glass with sugar and orange zest. "
    },
    "basil_julep": {
        "description": "For a killer Basil Julep, use fresh basil leaves and muddle them gently to release their aroma, not pulverize them.  Don't be afraid to adjust the whiskey to your taste, and remember, a good gum syrup is key.  A light hand with the ice is crucial to keep it chilled but not watery.  Finish with a sprig of basil for an elegant touch. "
    },
    "410_gone": {
        "description": "For a perfect 410 Gone, chill your Coca-Cola. It helps maintain the fizz and keeps the drink refreshingly cold. Use good quality peach vodka for a more pronounced flavor. Don't over-pour the vodka; a 1:2 ratio with Coca-Cola is ideal. A simple garnish of a peach slice or a maraschino cherry adds a touch of elegance. "
    },
    "buena_vista": {
        "description": "When crafting the Buena Vista, remember that gum syrup adds sweetness and body, so adjust it to your guest's preference. The Ancho Reyes adds a spicy kick, so use it sparingly.  Fresh lime juice is key to balance the sweetness and spice. Lastly, a dash of cocoa bitters enhances the complexity and creates a unique, smoky aroma.  "
    },
    "mayan_blood": {
        "description": "For a vibrant Mayan Blood, use fresh blood orange juice for the best flavor. Shake hard with ice to ensure a frosty chill.  Don't skimp on the passionfruit syrup, it balances the bitterness of Campari. Strain into a chilled coupe or martini glass, and garnish with a blood orange twist for that extra visual pop. "
    },
    "london_town": {
        "description": "The key to a good London Town is balance. Use a high-quality gin, as its flavor will shine through. A good dash of orange bitters adds complexity, but don't overdo it.  Chill your glass and stir the ingredients with ice until well-chilled. This ensures the cocktail is properly diluted and the flavors meld beautifully. Garnish with a flamed orange peel for an aromatic finish. "
    },
    "king_smash_mule": {
        "description": "**Muddle mint leaves gently** with ginger syrup and lemon juice, don't crush them. This releases the mint's aroma without bitterness. **Use a good quality bourbon**, as it's the star of the show. **Don't over-shake** the cocktail, as it will dilute the flavors. **Top with a splash of club soda** just before serving, keeping the fizz alive. **Garnish with a fresh mint sprig** for a beautiful and fragrant finish. "
    },
    "mai_tai": {
        "description": "Use a high-quality light rum for a truly authentic Mai Tai.  Orgeat syrup can be tricky, so taste it before adding; some are too sweet.  Triple Sec adds citrus, but don't overdo it. Sweet and sour is essential, but adjust the amount for desired sweetness. A fresh lime wedge is a must for garnish. Shake well with ice for a frosty, refreshing drink. "
    },
    "kill_the_cold_smoothie": {
        "description": ""
    },
    "kamikaze": {
        "description": "For a crisp Kamikaze, use high-quality vodka and triple sec.  Shake well with ice, ensuring the lime juice is freshly squeezed. Strain into a chilled martini glass. Garnish with a lime wheel or a twist for a professional touch. Remember, less ice results in a stronger drink. "
    },
    "pegu_club": {
        "description": "When making a Pegu Club, prioritize fresh lime juice for that bright acidity.  Use a good quality gin for the base, and don't skimp on the bitters! A few dashes of both Angostura and orange bitters will add complexity and balance the sweetness of the Curaçao.  Shake with ice until well-chilled, and strain into a chilled coupe for a classic presentation.  Enjoy! "
    },
    "irish_spring": {
        "description": "Start with a chilled glass.  Shake the whiskey, peach brandy, orange juice, and sweet & sour vigorously with ice.  Double strain into the glass to ensure a smooth texture.  Garnish with a bright orange slice and a maraschino cherry.  Adjust sweetness to taste by adding more sweet & sour or a splash of simple syrup.  "
    },
    "tequila_sunrise": {
        "description": "Start with a tall glass filled with ice. Pour tequila, followed by orange juice, leaving a little space at the top.  Gently pour grenadine over the back of a spoon to create the layered effect -  it should sink to the bottom.  No stirring! This cocktail is all about the visual appeal, so take your time with the grenadine pour. "
    },
    "brooklyn": {
        "description": "Chill your ingredients! A Brooklyn is best enjoyed ice-cold.  Use high-quality rye for a richer flavor. Measure your vermouth carefully - too much will drown out the rye. A dash of bitters adds complexity.  Muddle the cherry for a touch of sweetness before adding to your shaker. Garnish with a cherry - optional, but pretty! "
    },
    "midnight_mint": {
        "description": "This one's all about layering.  Chill your glass and ingredients beforehand.  Pour the Baileys slowly down the side to form the bottom layer.  Carefully add the Creme de Menthe, letting it float on top.  Finish with a thin layer of cream.  A gentle swirl with a skewer adds a touch of elegance, but avoid overmixing! "
    },
    "dead_mans_handle": {
        "description": "When making a Dead Man's Handle, the key is balance. Use a good quality Orgeat syrup, not overly sweet. Shake hard with ice to chill and dilute, but don't over-shake – you want a light foam, not a slushy. Adjust lime juice for desired tartness. Garnish with a lime wheel for a classic touch. "
    },
    "jamaican_coffee": {
        "description": "Use a good quality dark rum for a rich flavor. Brew strong coffee, ideally with a French press, and let it cool completely before mixing.  Chill the rum and water beforehand.  For the whipped cream, use a good quality heavy cream and add a pinch of powdered sugar.  Layer the ingredients carefully for a visually appealing presentation. "
    },
    "egg_nog_#4": {
        "description": "When making Egg Nog #4,  ensure your egg yolks are at room temperature for optimal emulsification.  Whip the egg whites separately for a frothy top.  Don't over-whip the cream; it should be soft peaks.  Measure your booze carefully and add the vanilla extract at the end to enhance its flavor.  Chill thoroughly before serving and grate fresh nutmeg for a beautiful finish. "
    },
    "godmother": {
        "description": "Chill your glassware beforehand for a perfectly chilled Godmother. Use a good quality vodka and amaretto for the best flavor. Shake vigorously with ice to ensure proper dilution and a frosty texture. Garnish with an orange peel for a citrusy aroma and visual appeal. Enjoy responsibly! "
    },
    "valencia_cocktail": {
        "description": "Use a high-quality apricot brandy for the best flavor.  Freshly squeezed orange juice is key, and don't skimp on the bitters – they add complexity. Shake well with ice to chill thoroughly, then strain into a chilled coupe glass. Garnish with an orange twist for a classic touch. "
    },
    "la_pasion": {
        "description": "When making La Pasion, a few tips will elevate your drink:1. **Use fresh lime juice:**  This brings brightness and balances the sweetness.2. **Chill your mezcal:**  This ensures a smooth and refreshing taste.3. **Shake with ice, not just stir:**  This chills the drink and helps blend the flavors.4. **Top with soda water gently:**  This creates a refreshing and bubbly finish.5. **Garnish with a lime wheel or passionfruit pulp:**  This adds a touch of elegance and complements the flavors. "
    },
    "raspberry_julep": {
        "description": "Use fresh mint for the best flavor. Muddle gently to release oils without bruising the leaves.  For a sweeter julep, use more raspberry syrup; for a tart twist, add a squeeze of lemon juice.  Don't over-crush the ice, you want it to be chunky for a slow, refreshing melt. Garnish with a sprig of mint and a fresh raspberry for a beautiful presentation. "
    },
    "salty_dog": {
        "description": "For a perfect Salty Dog, use fresh grapefruit juice - the tartness is key. A good quality gin is essential.  Rim the glass with coarse salt *before* adding ice, to prevent it from dissolving.  Shake the gin and juice with ice, then strain into the glass, ensuring the rim is salted.  Garnish with a grapefruit wedge for an extra burst of flavor. "
    },
    "citrus_coke": {
        "description": "For a refreshing Citrus Coke, use a chilled highball glass and fill it with ice. Pour in the Bacardi Limon first, followed by the Coca-Cola. This ensures the rum's citrus flavors are well-integrated. A squeeze of lime or a lime wedge garnish adds a beautiful touch and enhances the citrus notes. Remember, you can adjust the ratio of rum to Coke to your liking, making it a perfect balance of sweet and tart. "
    },
    "apello": {
        "description": "Apello sounds refreshing!  To make it perfect, use fresh-squeezed juice for the best flavor.  Don't over-shake, as you want to retain the natural sweetness of the juices.  A maraschino cherry garnish adds a playful touch, but you can also try a lime wedge for a zesty twist.  Remember to adjust the proportions based on your preference for sweetness and tartness. "
    },
    "sangria": {
        "description": "For a vibrant sangria, use a high-quality red wine with fruity notes. Don't over-sugar, a touch is enough. Let the fruit macerate in the wine for at least 2 hours, preferably overnight, for optimal flavor infusion. Use fresh citrus juice for the brightest taste. A splash of brandy adds complexity. "
    },
    "herbal_flame": {
        "description": "When crafting the Herbal Flame, remember that the Hot Damn, Tea is the star. Use a high-quality, strong brew for maximum flavor. Muddle the mint gently to release oils without bruising the leaves. Shake vigorously with ice to chill the cocktail thoroughly and create a frothy top. Garnish with a sprig of mint and a splash of sparkling water for an extra touch.  "
    },
    "dos_besitos": {
        "description": "To ensure your Dos Besitos sings, use fresh lime juice and good quality agave nectar. Shake hard with ice to chill thoroughly.  The grenadine adds sweetness, so adjust it to your liking. A splash of soda water can add a light fizz. Garnish with a lime wheel and enjoy the tequila-forward, fruity delight! "
    },
    "buccaneer": {
        "description": "Chill your Corona and Bacardi Limon thoroughly before mixing.  Use a tall, chilled glass.  For a more flavorful and refreshing drink, squeeze a lime wedge into the glass before adding the Corona.  Garnish with a lime wedge and enjoy! "
    },
    "van_vleet": {
        "description": "Use a high-quality light rum for a brighter flavor.  Shake vigorously with ice to chill and dilute the cocktail properly.  Adjust the maple syrup to your sweetness preference.  A good quality lemon juice will add brightness and balance.  Strain into a chilled coupe glass for a refreshing presentation. "
    },
    "lemon_drop": {
        "description": "For a perfect Lemon Drop, use a good quality vodka and fresh lemon juice.  Chill your martini glass and rim it with sugar for a sweet and tart contrast.  Shake your ingredients with ice until well chilled, then strain into the glass.  Garnish with a lemon twist for a touch of elegance and aroma. Remember, a good Lemon Drop is all about balance, so adjust the sweetness and tartness to your taste. "
    },
    "fahrenheit_5000": {
        "description": "This cocktail sounds fiery!  Here are some tips: * **Start with a chilled glass:** This will keep the drink cold and prevent the ice from melting too quickly.* **Use fresh ice:** This will ensure that your drink is properly diluted.* **Shake well:**  This will properly blend the ingredients and chill the cocktail.* **Strain the drink:**  Remove any ice shards before serving to avoid a watery drink. * **Garnish with a peppercorn:**  This adds a nice touch of flavor and visual appeal."
    },
    "english_rose_cocktail": {
        "description": "This cocktail calls for balance.  Start with a chilled glass. Use quality gin and apricot brandy. Measure carefully, ensuring the vermouth doesn't overwhelm the gin. Shake vigorously with ice to chill thoroughly. Strain into the glass, and gently float the grenadine on top for a vibrant color gradient. Garnish with a lemon twist and a cherry for a classic finish. "
    },
    "mulled_wine": {
        "description": "For a perfect Mulled Wine, simmer gently, don't boil! This prevents the alcohol from evaporating and the flavors from becoming bitter.  Use quality red wine and brandy for a richer flavor. Add the sugar last to avoid caramelization. Strain before serving to remove spices and enjoy warm! "
    },
    "252": {
        "description": "The 252 is a potent concoction, so approach it with respect. * **Chill everything:**  Ice-cold ingredients are key for a refreshing drink. * **Use a good quality 151 Proof Rum:** This is the star of the show.* **Measure accurately:**  The high alcohol content makes precise measurements essential. * **Shake vigorously:**  A strong shake creates a well-balanced and chilled cocktail. * **Garnish simply:** A lime wedge or cherry adds a touch of elegance. "
    },
    "orangeade": {
        "description": "For a perfect Orangeade, balance is key! Use fresh juices for the best flavor.  Start with a 1:1 ratio of lemon to orange juice, adjust to taste.  A good syrup-to-juice ratio is 1:2, but you can sweeten to your liking.  Soda water is your final touch, adding fizz.  Chill everything before mixing for a refreshing drink.  Don't over-shake, you want the soda to stay bubbly!  Garnish with a citrus wheel for a beautiful touch. "
    },
    "royal_gin_fizz": {
        "description": "For a perfect Royal Gin Fizz, **use a good quality gin** for maximum flavor. **Freshly squeeze your lemon juice** for bright acidity. **Dry shake** the gin, lemon, sugar, and egg white vigorously to emulsify and create a frothy head. **Don't overshake**, or you'll get a bitter taste. **Shake again with ice** to chill the drink. **Top with carbonated water** gently, allowing it to settle on top of the foam. "
    },
    "frisco_sour": {
        "description": "For a perfect Frisco Sour, focus on balance. Use a high-quality blended whiskey with a smooth finish.  Don't skimp on the Benedictine, its herbal notes are crucial.  When juicing the citrus, go for a 2:1 ratio of lemon to lime for a bright, tart flavor. Finally, a light egg white foam adds elegance and texture.  Shake well with ice, strain into a chilled coupe, and garnish with a lemon twist. "
    },
    "smut": {
        "description": "This cocktail is all about balance.  Use a good quality red wine, not too sweet, and a quality peach schnapps.  Don't overpower the delicate peach with too much orange juice.  Start with a small amount and adjust to taste.  The Pepsi Cola adds a bit of sweetness and fizz, so use it sparingly.  Remember, less is more, and you can always add more if needed.  Cheers! "
    },
    "bronx_cheer": {
        "description": "This drink is all about balance.  Use a high-quality rye for a complex flavor profile.  Ensure your raspberry syrup is homemade for a vibrant fruitiness.  Don't skimp on the Falernum - it adds depth and spice.  Shake hard with ice to chill and dilute, then strain into a chilled coupe.  Garnish with a lime wheel for an extra pop of tartness.  Enjoy! "
    },
    "gin_squirt": {
        "description": "Muddle strawberries with powdered sugar to release their sweetness. Use fresh pineapple juice, not canned, for a more vibrant flavor. Add a dash of grenadine at the end for a beautiful color gradient. Don't over-shake - you want a light, bubbly texture. Garnish with a strawberry slice and pineapple wedge for a tropical touch. "
    },
    "mule_in_paradise": {
        "description": "To make a perfect Mule in Paradise, use a quality ginger syrup with a strong ginger flavor and a fresh passionfruit syrup for a vibrant sweetness. Don't skimp on the lime juice, as it balances the sweetness and adds a tart edge. Shake hard with ice for a frothy, chilled result. Top with soda, not club soda, for a gentle fizz. Garnish with a passionfruit wheel for a visually appealing touch.  "
    },
    "bubble_gum": {
        "description": "For a perfectly balanced Bubble Gum, use a good quality vodka and a banana liqueur that's not too sweet.  Freshly squeezed orange juice is key, but don't overdo it.  Start with a small amount of peach schnapps and adjust to taste.  Shake with ice until chilled and strain into a chilled glass. A rim of sugar or orange zest adds a nice touch. "
    },
    "balmoral": {
        "description": "The Balmoral is a classic, but a subtle one.  Use a good quality Scotch, and don't skimp on the vermouths.  Chill your ingredients well, especially the vermouths.  A dash of bitters adds complexity, but don't overdo it.  Stir, don't shake, to keep the cocktail smooth.  Garnish with an orange twist for a classic touch. "
    },
    "adam": {
        "description": "For a balanced Adam, use a good quality dark rum and fresh lemon juice.  Don't skimp on the grenadine, it adds the sweetness and vibrant color.  Shake well with ice to chill and dilute.  Strain into a chilled coupe glass and garnish with a lemon twist or a cherry.  Enjoy! "
    },
    "stone_sour": {
        "description": "For a killer Stone Sour, remember these tips: * Use a good quality Apricot Brandy for a richer flavor.* Freshly squeezed orange juice is key, avoid bottled.* Don't be shy with the sweet and sour mix, it balances the tartness.* Shake well with ice for a frosty, refreshing drink.* Garnish with a Luxardo cherry and a twist of orange peel. "
    },
    "danbooka": {
        "description": "This sounds like a potent concoction!  The Danbooka is a high-proof cocktail, so use Everclear sparingly.  Start with a small amount and adjust to taste.  A good coffee base is crucial - fresh brewed or strong cold brew works best.  Chill both ingredients for a super smooth experience.  Be mindful of the high alcohol content and sip slowly! "
    },
    "orange_oasis": {
        "description": "For a vibrant Orange Oasis, chill your glass and ingredients beforehand.  Use a good quality cherry brandy for depth and a premium gin for balance.  Shake the cherry brandy, gin, and orange juice with ice to ensure proper dilution.  Top with chilled ginger ale for a refreshing fizz.  Garnish with a fresh orange slice and a maraschino cherry. "
    },
    "bob_marley": {
        "description": "This sounds like a fun, but potentially challenging combination!  Here's the key: **temperature**. The Midori needs to be cold, so chill it in advance.  The Jägermeister and Goldschlager will be best served very cold too, so use a chilled mixing glass.  This will ensure the flavors blend properly and don't become overly strong.  Also, a good shake is essential to bring out the full potential of the cocktail. "
    },
    "vieux_carre": {
        "description": "When making a Vieux Carré, chilling the glass beforehand is key for a refreshing experience.  Use a good quality rye and brandy for depth of flavor. Don't skimp on the Benedictine; it adds complexity.  Stir gently, not vigorously, to avoid bruising the ingredients.  Garnish with a lemon twist and enjoy the rich, elegant complexity. "
    },
    "honey_bee": {
        "description": "To ensure a perfectly balanced Honey Bee, use a high-quality white rum for a clean, crisp base.  When mixing, start with a small amount of honey and adjust to your sweetness preference.  Shake vigorously with ice to chill thoroughly and dilute the honey.  A touch of lemon zest as garnish adds a lovely aroma and visual appeal. "
    },
    "backsliding_presbyterian": {
        "description": "This cocktail is a balancing act of sweet, spicy, and bitter. Ensure your ginger syrup is fresh and potent. Use a good quality bourbon for a smooth base. When mixing, shake vigorously with ice to chill thoroughly. Finish with a generous splash of soda to brighten the flavors and create a refreshing fizz. "
    },
    "pina_colada": {
        "description": "For a perfect Pina Colada, use good quality light rum and fresh pineapple juice.  Blend with ice until smooth, but not too slushy.  A touch of cream of coconut adds richness, but don't overdo it.  Garnish with a pineapple wedge and cherry for a classic touch.  Remember, the key is balance –  sweetness from the pineapple, creaminess from the coconut, and the subtle rum flavor coming through. "
    },
    "the_last_word": {
        "description": "When making a Last Word, chill your glassware beforehand.  Shake vigorously with ice, using a good quality gin for optimal flavor.  Strain into a chilled coupe glass, and use a high-quality Green Chartreuse for its complex herbal notes.  The perfect Last Word balances bitterness, sweetness, and citrus, so adjust the lime juice for your desired taste. "
    },
    "royal_fizz": {
        "description": "The Royal Fizz is a classic, but requires finesse.  Use a good quality gin, and ensure the sweet and sour is well balanced.  When adding the egg, shake vigorously with ice to emulsify it properly.  Top with Coca-Cola, but don't overpour!  This drink is best enjoyed fresh, so don't make it too far ahead of time. "
    },
    "bellini": {
        "description": "For a perfect Bellini, chill your champagne flute well. Use high-quality peach schnapps, not flavored vodka.  Pour a shot of schnapps into the glass and top with chilled champagne.  A gentle pour, avoiding too much foam, creates a beautiful layered effect. Garnish with a peach slice or a few fresh peach slices for an extra touch. "
    },
    "cream_soda": {
        "description": "For a perfect Cream Soda, start with high-quality spiced rum.  Use a chilled glass and fill it with ice. Add rum, then top with ginger ale, leaving a bit of headroom for the fizz.  A squeeze of lime adds a refreshing brightness.  Don't over-shake or stir – you want the ginger ale to retain its effervescence.  Enjoy! "
    },
    "gin_rickey": {
        "description": "A Gin Rickey is a refreshing classic, but it's easy to get wrong.  Use a good quality gin, and fresh-squeezed lime juice for the best flavor.  The grenadine is a subtle touch, just a splash for a hint of sweetness.  Chill the glass beforehand, and top with club soda, not tonic.  Garnish with a lime wheel and a sprig of mint for an extra touch of elegance. "
    },
    "monsieur_manhattan": {
        "description": "For a perfect Monsieur Manhattan, use high-quality Demerara gum syrup for a rich, caramelized sweetness. Chill all ingredients beforehand, especially the whiskey and brandy, for a refreshing, balanced cocktail. Use a good quality sweet vermouth and don't skimp on the aromatic bitters, as they add depth and complexity. Stir gently with ice, ensuring a smooth and cold mixture. Garnish with a cherry or an orange twist for a classic touch. "
    },
    "gin_swizzle": {
        "description": "When making a Gin Swizzle, use a good quality gin for a bright flavor. Freshly squeezed lime juice is key. A bar spoon of simple syrup or agave nectar will balance the tartness, adjust to your preference.  A few dashes of Angostura bitters add complexity.  Swizzle vigorously to create a frosty, well-mixed drink. Top with club soda for a refreshing fizz. "
    },
    "gimlet": {
        "description": "For a perfect Gimlet, use freshly squeezed lime juice for the brightest flavor.  A good quality gin is key, but don't over-muddle the lime.  A slight twist of lime zest adds a beautiful aroma.  If you're using simple syrup, make sure it's properly dissolved, and use a good bar spoon to stir the cocktail for proper dilution.  Enjoy! "
    },
    "campari_beer": {
        "description": "Use a high-quality lager for a clean base. Chill everything well before mixing. Start with a 1:1 ratio of Campari to beer, but adjust to taste. For a more intense Campari flavor, use a slightly higher ratio.  Garnish with an orange peel for a classic touch. "
    },
    "wine_punch": {
        "description": "To elevate your Wine Punch, use a good quality red wine with bright fruit notes.  Don't be afraid to muddle your orange slices for a more intense citrus aroma. Freshly squeezed orange juice is a must, and balance the sweetness with a splash of pineapple juice. Chill the punch thoroughly for a crisp, refreshing taste.  Serve over ice with a garnish of orange and pineapple wedges. "
    },
    "ace": {
        "description": "This sounds like a twist on a classic!  To make a smooth, silky Ace, focus on the egg white.  Dry shake it first (without ice) to create a frothy texture, then add ice for a proper shake.  The grenadine should be a *splash* to add color and sweetness, not overwhelm the gin.  Heavy cream and milk balance the richness.  Lastly, a beautiful garnish, like a cherry or orange zest, elevates the presentation. "
    },
    "oatmeal_cookie": {
        "description": "Start by chilling all ingredients for a smoother, colder drink.  Measure carefully – this cocktail is about balance, not strength.  Layer the ingredients in the order listed, creating a beautiful visual.  Shake well with ice, but don't over-shake to avoid excessive dilution.  Strain into a chilled coupe glass.  Garnish with a chocolate shavings or a mini cookie for a playful touch. "
    },
    "fruit_flip_flop": {
        "description": "**Fruit Flip-Flop Tips:*** Use thick, Greek yogurt for a creamy texture.* Blend the fruit juice and yogurt thoroughly for a smooth consistency.* Adjust the sweetness by adding a touch of honey or simple syrup to your liking.* Experiment with different fruits for a variety of flavor profiles.* Garnish with fresh fruit slices or a sprig of mint for an elegant touch. "
    },
    "whisky_mac": {
        "description": "The Whisky Mac is a simple yet classic drink, but there are a few tricks to make it shine. Use a good quality Scotch with some age for depth. Opt for a sweet, fortified wine like ruby port or sweet vermouth.  Chill both ingredients beforehand for a refreshing experience.  Shake vigorously with ice to dilute and chill the drink, then strain into a chilled coupe glass. Garnish with a twist of orange peel for a touch of citrus aroma. "
    },
    "kentucky_mule": {
        "description": "When making a Kentucky Mule, fresh is best! Squeeze your limes right before mixing.  A good ginger syrup is key – homemade is ideal, but a quality bottled option will do.  Don't over-shake, as it'll make the drink too frothy.  Use a copper mug if you have one, it chills faster and enhances the flavors. Finally, top with a splash of soda, not a full pour, for a lighter and more refreshing finish. "
    },
    "fig_old_fashioned": {
        "description": "Use a good quality fig syrup, preferably homemade for a more complex flavor. A dash of Angostura bitters adds a warm spice that complements the fig.  Muddle the fig syrup with the bitters in the bottom of the glass to release its aromas.  Use a large ice cube for slower dilution and a smoother drink.  Garnish with a fig slice or a sprig of rosemary for a touch of elegance. "
    },
    "avalon": {
        "description": "**Avalon Bartender Tips:**- Use a good quality vodka for a clean base.- Freshly squeeze lemon juice for the best flavor. - Balance the sweetness of the pisang ambon with the tartness of the lemon juice.- Shake well with ice to chill and blend the flavors.- Garnish with a slice of apple or a lemon twist. "
    },
    "thai_iced_coffee": {
        "description": "For a killer Thai Iced Coffee, use strong, freshly brewed coffee. Don't skimp on the sugar – it should be sweet!  Dissolve the sugar in hot coffee for a silky texture.  Use heavy cream, not milk, for richness.  Toast the cardamom pods before grinding – it releases the aroma and adds a warm complexity.  Serve over ice with a splash of cream on top for an extra touch. "
    },
    "coffee_liqueur": {
        "description": "For a smooth coffee liqueur, use freshly brewed, strong coffee. Steep the coffee grounds for a slightly longer time than usual for a more concentrated flavor. A high-quality vodka will yield a cleaner taste. Vanilla extract enhances the coffee aroma, so use a good quality one. Finally, adjust sugar to your preference - a little goes a long way!  "
    },
    "lazy_coconut_paloma": {
        "description": "For a balanced Lazy Coconut Paloma, use a high-quality coconut liqueur with subtle sweetness. Fresh grapefruit juice is key, so make sure it's not overly bitter. Build the drink over ice, starting with the liqueur, then juice, and top with soda water for optimal carbonation. Don't overshake, as it will dilute the flavors. Garnish with a grapefruit wedge for a refreshing touch. "
    },
    "747_drink": {
        "description": "To make the 747 Drink shine, use a high-quality vodka for a clean base. Freshly squeeze your lime juice, and use a good quality cranberry juice. Shake the vodka, lime juice, and cranberry juice with ice to chill thoroughly before topping with Sprite. This ensures a balanced, refreshing drink. Garnish with a lime wedge for a touch of elegance. "
    },
    "whippersnapper": {
        "description": "Use a good quality bourbon for a richer flavor profile.  Make sure the raspberry gum syrup is well-dissolved, or you'll get a gritty texture. Don't skimp on the bitters!  A couple of dashes really help to round out the flavors and add complexity.  Shake well with ice to ensure a good chill and dilution.  Strain into a chilled coupe glass for a refreshing and elegant presentation. "
    },
    "zima_blaster": {
        "description": "To make a Zima Blaster, it's all about keeping the Chambord cool.  Chill both Zima and the Chambord in the freezer for at least 30 minutes before making the cocktail.  This ensures a crisp, refreshing flavor that's not overly sweet.  When pouring the Chambord, go slow and steady to avoid over-sweetening the drink.  Finish with a splash of soda water for a bubbly finish. "
    },
    "opposites_attract": {
        "description": "Muddle mint gently to release oils, not pulverize it.  Use a good quality Irish whiskey for a smoother base.  Ancho Reyes adds spice, so adjust to taste, starting with a dash.  Shake well with ice to chill and dilute, then strain for a refreshing finish.  Garnish with a lime wedge and sprig of mint, and enjoy! "
    },
    "paper_plane": {
        "description": "For a perfect Paper Plane, use a good quality bourbon and a balanced amaro like Averna or Montenegro.  Shake well with ice to ensure proper dilution and chilling.  Use fresh lemon juice, not bottled, and make sure the Aperol is cold, too. Strain into a chilled coupe glass for a crisp, refreshing drink. "
    },
    "planters_punch": {
        "description": "For a balanced Planter's Punch, start with a good quality dark rum.  Use fresh juices, preferably squeezed, for the best flavor.  Orgeat syrup can be quite sweet, so adjust the amount based on your preference.  Don't overshake - a gentle shake is best to maintain the fizz.  Garnish with a pineapple wedge and a cherry for a classic touch. "
    },
    "city_slicker": {
        "description": "This drink calls for a good quality brandy.  Use a  freshly squeezed lemon, and don't over-shake the cocktail, as it can become cloudy. A little triple sec goes a long way, so start with a small amount and adjust to taste.  A simple syrup addition can help balance the tartness.  Garnish with a lemon twist or a brandied cherry for a classy touch. "
    },
    "jamaica_kiss": {
        "description": "For a smooth Jamaica Kiss, use high-quality coffee liqueur and light rum. Chill your milk beforehand for a refreshing drink. Shake with ice vigorously to ensure proper dilution and a frosty texture. Strain into a chilled coupe glass, leaving the ice behind. Garnish with a coffee bean or cinnamon stick for a sophisticated touch. "
    },
    "flowering_fields": {
        "description": "This cocktail's complexity lies in its balance.  Use a good quality rye for backbone and a high-proof Absinthe for its anise kick.  Ensure the Green Chartreuse isn't overpowering, use it judiciously.  The pineapple syrup adds sweetness, so don't go overboard with lime juice.  Shake hard with ice to chill, and strain to avoid any ice shards in your drink. A splash of bitters adds complexity, but go easy, a dash will suffice. "
    },
    "snowday": {
        "description": "When making the Snowday, chill all ingredients beforehand for a crisp, refreshing experience. Use freshly squeezed blood orange juice for optimal flavor.  Muddle the orange peel slightly before adding to the shaker to release its oils. Shake hard with ice, then double strain to ensure a smooth, clear cocktail. Garnish with a fresh orange twist for a beautiful presentation. "
    },
    "rum_cobbler": {
        "description": "For a perfect Rum Cobbler, use a good quality dark rum, and freshly squeezed lemon juice. Muddle the sugar with the lemon to release its oils and create a fragrant base. Chill the glass beforehand and top with ice and club soda, ensuring a gentle pour to avoid over-carbonation. Garnish with a maraschino cherry and a twist of orange peel, allowing the oils to release their scent. "
    },
    "hunters_moon": {
        "description": "For a balanced Hunter's Moon, use a dry vermouth for a crisp bite. Muddle the blackberries gently to release their flavor without making it too bitter.  Chill your lemonade thoroughly and use a good quality sugar syrup to ensure sweetness without cloying. Garnish with a fresh blackberry and a maraschino cherry for a beautiful presentation. "
    },
    "zizi_coin_coin": {
        "description": "The Zizi Coin-coin is a simple yet elegant drink.  Here are some tips for a perfect pour:* **Chill your glass:** This ensures the drink stays cold longer.* **Use fresh lemon juice:** This makes a huge difference in flavor.* **Shake hard:** A vigorous shake chills the drink and mixes the ingredients thoroughly.* **Strain carefully:** This removes any ice shards for a smooth texture.* **Garnish with a lemon twist:** Adds a beautiful touch and enhances the aroma. "
    },
    "vodka_martini": {
        "description": "For a perfect Vodka Martini, chill your glass and ingredients beforehand. Use high-quality vodka and good dry vermouth, but just a splash - you want the vodka to shine. Stir, don't shake, to avoid dilution. Garnish with a single olive, preferably a plump green one. Remember, a Martini should be chilled, crisp, and elegant. "
    },
    "boulevardier": {
        "description": "Chill your glass and ingredients beforehand. Use high-quality rye and vermouth for the best flavor.  Don't skimp on the Campari - it's essential for that bitter-sweet balance.  Stir well with ice to chill and dilute.  Garnish with an orange peel for a classic touch, but a cherry works too. "
    },
    "pineapple_paloma": {
        "description": "For a perfect Pineapple Paloma, use high-quality tequila and fresh juices. Muddle the lime with a little sugar for a sweet and tangy base. Shake well with ice to ensure proper dilution and a chilled cocktail. Finish with a pinch of pepper for a spicy kick. Garnish with a lime wedge and pineapple spear for a vibrant presentation. "
    },
    "quick_sand": {
        "description": "Start with a chilled glass to keep the Quick-Sand refreshing. Use a good quality black sambuca for a richer flavor. When layering the sambuca and orange juice, pour the sambuca slowly down the side of the glass to avoid mixing them immediately. A slight tilt will help create a visually appealing gradient.  Garnish with a twist of orange peel for a fragrant touch. "
    },
    "french_connection": {
        "description": "Use a good quality Cognac for the best flavor.  Chill both the Cognac and Amaretto before mixing.  Use a chilled glass for serving.  Shake vigorously with ice to ensure proper dilution and a frosty finish.  Don't over-shake; aim for a smooth, velvety texture.  Garnish with a cherry or orange peel for a touch of elegance. "
    },
    "pisco_sour": {
        "description": "**For a perfect Pisco Sour:**- Use fresh lemon juice for the best flavor.- Dry shake the egg white and ice first to create a frothy head.- Don't over-shake; the egg white will become too frothy.- Once shaken, strain the cocktail into a chilled coupe glass for a clean, elegant presentation.- Garnish with a few drops of Angostura bitters and a lemon twist. "
    },
    "thai_iced_tea": {
        "description": "For a perfect Thai Iced Tea, brew strong black tea, let it cool completely, and sweeten with condensed milk to your liking.  Don't rush the chilling -  a long, slow chill brings out the best flavor.  Muddle fresh mint for a fragrant garnish, or add a sprig to the glass for a refreshing aroma.  A splash of lime juice adds a touch of tartness, but use sparingly!"
    },
    "sherry_eggnog": {
        "description": "Use a good quality dry sherry, like fino or manzanilla, for a balanced flavor. Whisk the egg yolks and sugar until light and fluffy, then slowly drizzle in the sherry, whisking constantly to prevent curdling.  Fold in the chilled milk and sprinkle with fresh nutmeg.  This will help ensure a smooth and creamy texture, and enhance the richness of the cocktail. "
    },
    "veteran": {
        "description": "For a balanced Veteran, use high-quality dark rum with rich molasses notes. Cherry brandy adds sweetness, so adjust the amount based on your preference. Don't over-shake; a light stir maintains the elegant layering. Garnish with a Luxardo cherry or a brandied cherry for a sophisticated touch. "
    },
    "artillery": {
        "description": "The Artillery is a simple yet elegant cocktail.  When making it, ensure your vermouth is chilled, as this will enhance its flavor.  Use a high-quality gin and a good dash of bitters, like Angostura, for depth.  Stir with ice until well-chilled, then strain into a chilled coupe glass.  Garnish with a lemon twist for a classic touch. "
    },
    "amaretto_sour": {
        "description": "For a perfectly frothy Amaretto Sour, use a good quality Amaretto and fresh lemon juice.  Dry shake the egg white and spirits first to create a smooth, creamy foam. Then add ice and shake again to chill. Strain into a chilled coupe glass and garnish with a lemon twist for a classic touch. "
    },
    "foxy_lady": {
        "description": "This cocktail is a creamy delight, but requires a bit of finesse. Chill your ingredients, especially the cream, for a smooth and refreshing drink.  Use a good quality Amaretto and Creme de Cacao for the best flavor.  Shake well with ice, and strain into a chilled coupe glass for a flawless presentation.  Garnish with a chocolate curl for a touch of elegance. "
    },
    "affair": {
        "description": "For a balanced Affair, start with a good quality strawberry schnapps for a sweet, fruity base.  Use fresh orange juice for brightness and cranberry juice for tartness.  Club soda adds fizz and helps to cut through the sweetness.  Adjust the ratio of juices to your liking, and always add the club soda last to maintain carbonation.  Serve over ice in a tall glass. "
    },
    "irish_curdling_cow": {
        "description": "This sounds like a fun, layered cocktail!  Start by chilling your glass.  Pour the Baileys in first, followed by the Bourbon and Vodka.  Then carefully layer the orange juice on top to create a beautiful visual.  You could use a bar spoon to help with the layering.  Garnish with a wedge of orange, and enjoy! "
    },
    "abilene": {
        "description": "When crafting the Abilene, freshness is key. Use a high-quality dark rum with rich molasses notes. For the peach nectar, opt for unsweetened or lightly sweetened varieties, and ensure the orange juice is freshly squeezed for optimal flavor. Shake with ice vigorously to chill and dilute properly, resulting in a balanced, refreshing cocktail. Garnish with a fresh peach slice or an orange peel twist for an aromatic touch. "
    },
    "jackhammer": {
        "description": "When crafting a Jackhammer, remember these tips:* **Chill your glasses:** This enhances the overall drinking experience.* **Use good quality ice:**  Avoid overly diluted cocktails.* **Shake well:**  This ensures the ingredients are thoroughly mixed.* **Strain into a chilled glass:**  Avoid any ice chips.* **Garnish:**  A cherry or orange peel adds a touch of elegance. "
    },
    "tequila_fizz": {
        "description": "For a perfect Tequila Fizz,  dry shake the tequila, lemon juice, and egg white vigorously for 20 seconds to emulsify the egg white.  Then, add ice and shake again. This creates a smooth, frothy top.  Finally, strain into a chilled glass and top with ginger ale for a refreshing fizz. "
    },
    "john_collins": {
        "description": "For a perfect John Collins, use a good quality Bourbon.  Freshly squeezed lemon juice is key.  Make a simple syrup ahead of time for ease.  Don't overshake, you want the drink to be lightly carbonated.  Use a Collins glass for the perfect presentation.  Garnish with both a cherry and an orange wheel. "
    },
    "miami_vice": {
        "description": "Use high-quality 151 rum for the best flavor.  Chill all ingredients beforehand, including the glass, for a refreshing drink.  Don't overshake, as this can cause the drink to become too diluted.  For a layered effect, pour the daiquiri mix first, then carefully top with the pina colada mix.  Garnish with a cherry and pineapple wedge for a classic Miami Vice look. "
    },
    "rail_splitter": {
        "description": "The Rail Splitter is a simple, refreshing drink that's easy to make, but there are a few tips to keep in mind:* Use a good quality ginger ale for the best flavor.* Adjust the sweetness by adding more or less sugar syrup to taste.* Shake the cocktail well with ice to chill it properly.* Garnish with a lemon wedge or a sprig of fresh mint for a touch of elegance. "
    },
    "thai_coffee": {
        "description": "To make the Thai Coffee a success, prioritize freshness. Use freshly ground coffee beans for the best flavor.  Steep the coffee with coriander and cardamom for a rich, aromatic brew. Don't skimp on the sugar, it balances the bitterness. Whip the cream until stiff peaks form, then carefully layer it on top of the coffee.  Serve immediately to maintain the cream's texture. "
    }
}